[
  {
    "source_file": "Dataset summaries and citations.docx.txt",
    "page": -1,
    "chunk_number": 1,
    "text": "Table 1. Description of studies included in the meta-analysis. Full article citations are listed after the table.\n\n\n\n\n\n\n \nCitation List\nAcuña E., A. A., Pastenes V., C., & Villalobos G., L. (2017). Carbon Sequestration and Photosynthesis in Newly Established Turfgrass Cover in Central Chile. Agronomy Journal, 109(2), 397–405. https://doi.org/10.2134/agronj2016.05.0257\nBraun, R. C., & Bremer, D. J. (2019). Carbon Sequestration in Zoysiagrass Turf under Different Irrigation and Fertilization Management Regimes. Agrosystems, Geosciences & Environment, 2(1), 1–8. https://doi.org/10.2134/age2018.12.0060\nCampbell, C., Seiler, J., Wiseman, P., Strahm, B., & Munsell, J. (2014). Soil Carbon Dynamics in Residential Lawns Converted from Appalachian Mixed Oak Stands. Forests, 5(3), 425–438. https://doi.org/10.3390/f5030425\nCarley, D. S., Goodman, D., Sermons, S., Shi, W., Bowman, D., Miller, G., & Rufty, T. (2011). Soil Organic Matter Accumulation in Creeping Bentgrass Greens: A Chronosequence with Implications for Management and Carbon Sequestration. Agronomy Journal, 103(3), 604–610. https://doi.org/10.2134/agronj2010.0335\nContosta, A. R., Lerman, S. B., Xiao, J., & Varner, R. K. (2020). Biogeochemical and socioeconomic drivers of above- and below-ground carbon stocks in urban residential yards of a small city. Landscape and Urban Planning, 196, 103724. https://doi.org/10.1016/j.landurbplan.2019.103724\nGautam, P., Young, J. R., Sapkota, M., Longing, S., & Weindorf, D. C. (2020). Soil carbon sequestration in bermudagrass golf course fairways in Lub"
  },
  {
    "source_file": "Dataset summaries and citations.docx.txt",
    "page": -1,
    "chunk_number": 2,
    "text": ", P., Young, J. R., Sapkota, M., Longing, S., & Weindorf, D. C. (2020). Soil carbon sequestration in bermudagrass golf course fairways in Lubbock, Texas. Agronomy Journal, 112(1), 148–157. https://doi.org/10.1002/agj2.20023\nGolubiewski, N. E. (2006). Urbanization Increases Grassland Carbon Pools: Effects Of Landscaping In Colorado’s Front Range. Ecological Applications, 16(2), 555–571. https://doi.org/10.1890/1051-0761(2006)016[0555:UIGCPE]2.0.CO;2\nHuh, K. Y., Deurer, M., Sivakumaran, S., McAuliffe, K., & Bolan, N. S. (2008). Carbon sequestration in urban landscapes: The example of a turfgrass system in New Zealand. Soil Research, 46(7), 610. https://doi.org/10.1071/SR07212\nHuyler, A., Chappelka, A. H., Fan, Z., & Prior, S. A. (2017). A comparison of soil carbon dynamics in residential yards with and without trees. Urban Ecosystems, 20(1), 87–96. https://doi.org/10.1007/s11252-016-0572-y\nHuyler, A., Chappelka, A. H., Prior, S. A., & Somers, G. L. (2014). Drivers of soil carbon in residential ‘pure lawns’ in Auburn, Alabama. Urban Ecosystems, 17(1), 205–219. https://doi.org/10.1007/s11252-013-0294-3\nLaw, Q. D., & Patton, A. J. (2017). Biogeochemical cycling of carbon and nitrogen in cool-season turfgrass systems. Urban Forestry & Urban Greening, 26, 158–162. https://doi.org/10.1016/j.ufug.2017.06.001\nQian, Y., & Follett, R. F. (2002). Assess"
  },
  {
    "source_file": "Dataset summaries and citations.docx.txt",
    "page": -1,
    "chunk_number": 3,
    "text": " Urban Greening, 26, 158–162. https://doi.org/10.1016/j.ufug.2017.06.001\nQian, Y., & Follett, R. F. (2002). Assessing soil carbon sequestration in turfgrass systems using long-term soil testing data. Agronomy Journal, 94, 930–935.\nQian, Y., Follett, R. F., & Kimble, J. M. (2010). Soil Organic Carbon Input from Urban Turfgrasses. Soil Science Society of America Journal, 74(2), 366–371. https://doi.org/10.2136/sssaj2009.0075\nRaciti, S. M., Groffman, P. M., Jenkins, J. C., Pouyat, R. V., Fahey, T. J., Pickett, S. T. A., & Cadenasso, M. L. (2011). Accumulation of Carbon and Nitrogen in Residential Soils with Different Land-Use Histories. Ecosystems, 14(2), 287–297. https://doi.org/10.1007/s10021-010-9409-3\nSapkota, M., Young, J., Coldren, C., Slaughter, L., & Longing, S. (2020). Soil physiochemical properties and carbon sequestration of Urban landscapes in Lubbock, TX, USA. Urban Forestry & Urban Greening, 56, 126847. https://doi.org/10.1016/j.ufug.2020.126847\nSelhorst, A. L., & Lal, R. (2011). Carbon budgeting in golf course soils of Central Ohio. Urban Ecosystems, 14(4), 771–781. https://doi.org/10.1007/s11252-011-0168-5\nSelhorst, A., & Lal, R. (2013). Net Carbon Sequestration Potential and Emissions in Home Lawn Turfgrasses of the United States. Environmental Management, 51(1), 198–208. https://doi.org/10.1007/s00267-012-9967-6\nShi, W., Bowman, D., & Rufty, T. (2012). Microbial"
  },
  {
    "source_file": "Dataset summaries and citations.docx.txt",
    "page": -1,
    "chunk_number": 4,
    "text": "51(1), 198–208. https://doi.org/10.1007/s00267-012-9967-6\nShi, W., Bowman, D., & Rufty, T. (2012). Microbial Control of Soil Carbon Accumulation in Turfgrass Systems. In R. Lal & B. Augustin (Eds.), Carbon Sequestration in Urban Ecosystems (pp. 215–231). Springer Netherlands. https://doi.org/10.1007/978-94-007-2366-5_11\nSmith, R. M., Williamson, J. C., Pataki, D. E., Ehleringer, J., & Dennison, P. (2018). Soil carbon and nitrogen accumulation in residential lawns of the Salt Lake Valley, Utah. Oecologia, 187(4), 1107–1118. https://doi.org/10.1007/s00442-018-4194-3\nTownsend-Small, A., & Czimczik, C. I. (2010). Carbon sequestration and greenhouse gas emissions in urban turf. Geophysical Research Letters, 37(2), n/a-n/a. https://doi.org/10.1029/2009GL041675\nTrammell, T. L. E., Pataki, D. E., Pouyat, R. V., Groffman, P. M., Rosier, C., Bettez, N., Cavender‐Bares, J., Grove, M. J., Hall, S. J., Heffernan, J., Hobbie, S. E., Morse, J. L., Neill, C., & Steele, M. (2020). Urban soil carbon and nitrogen converge at a continental scale. Ecological Monographs, 90(2). https://doi.org/10.1002/ecm.1401\nWang, Y., Tu, C., Li, C., Tredway, L., Lee, D., Snell, M., Zhang, X., & Hu, S. (2014). Turfgrass Management Duration and Intensities Influence Soil Microbial Dynamics and Carbon Sequestration. International Journal of Agriculture & Biology, 16, 139–145.\n\n"
  },
  {
    "source_file": "Dataset summaries and citations.docx.txt",
    "page": -1,
    "chunk_number": 5,
    "text": "grass Management Duration and Intensities Influence Soil Microbial Dynamics and Carbon Sequestration. International Journal of Agriculture & Biology, 16, 139–145.\n\n"
  }
]