[
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 1,
    "text": "\n\n\n\n\n\n\n\n\nTemplate for P.G., Programmes \n\n\nChoice Based Credit System (CBCS), Learning Outcomes Based Curriculum Framework (LOCF) Guideline Based Credits and Hours Distribution System\nfor all Post – Graduate Courses including Lab Hours\n\nFirst Year – Semester – I \nSemester-II\nSecond Year – Semester – III\nSemester-IV\n\nTotal 91 Credits for PG Courses \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSEMESTER  I (CORE)\nCourse Name: THEORIES OF PERSONALITY\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\nOBJECTIVES: \nMajor objectives of this course are:\nTo make the student understand about personality and its determinants\nTo know the fundamentals of personality theory and its emergence to gain insight about human behavior. To understand the significance of each school of thought in psychology\nTo compare and contrast the conceptual framework of various theories of personality\nTo know the recent trends in personality theories how its applied in the field of psychology\n\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Understand the determinants of psychology and how it emerged as significant concept of psychology\nCO2(K2): Classify and compare various personality theories’ basic principles and approaches in understanding human nature. CO3(K4): Explain a critical understanding of personality through various Western approaches including type and trait, psychoanalytic, socio-cognitive, and humanistic and contemporary theories. CO4(K5): Apply different personality theory’s perspectives by engaging students in a discussion about the everyday applications of various personality theories. CO5(K5): Adapt to apply principles of personality in counseling practices. Lesson - Units\nUnit – I: Introduction to personality Theory - Nature of Personality- Personality theory and history. Definitions- Personality, Paradox of human nature. Personality in perspective: genetic, environmental, learning, parental, developmental factors. Unit – II:Psychodynamic Approach: Sigmund Freud- Psychoanalysis, Alfred Adler- Individual Psychology, Carl Jung- Analytical Psychology, Klein- Object Relations Theory\nUnit – III:Neo Psychoanalytic Approach: Karen Horney- Psychoanalytic Social Theory, Erich Fromm- Humanistic Psychoanalysis, Sullivan- Interpersonal Theory, Erikson- Post-Freudian Theory\nUnit – IV:Humanistic Approach/ Type/Cognitive /Dispositional:  Abraham Maslow- Holistic Dynamic theory."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 2,
    "text": "Unit – II:Psychodynamic Approach: Sigmund Freud- Psychoanalysis, Alfred Adler- Individual Psychology, Carl Jung- Analytical Psychology, Klein- Object Relations Theory\nUnit – III:Neo Psychoanalytic Approach: Karen Horney- Psychoanalytic Social Theory, Erich Fromm- Humanistic Psychoanalysis, Sullivan- Interpersonal Theory, Erikson- Post-Freudian Theory\nUnit – IV:Humanistic Approach/ Type/Cognitive /Dispositional:  Abraham Maslow- Holistic Dynamic theory. Carl Rogers- Person-Centered theory, May – Existential Psychology, Eysenck -Trait and factor theory, Allport -Psychology of the Individual, BIG 5 Theory\nUnit – V: Behavioristic Approach/ Recent Theory:   Skinner- Behavioral Analysis, Albert Bandura-Social Cognitive theory,  Rotter&Mischel -Cognitive Social Theory , Seligman- Positive Psychology approach\nRecap: Factors contribute to constitute personality, chronological and emergence of various personality theories, concept of human from Various theory, understanding of human nature from birds’ eyes views with interpretations of significant theorists in personality. Learning Resources:\nRecommended Text books:\nDuanep, Schultz & Sydney Ellen Schultz (2012). Theories of Personality (10thEdn. )New Delhi: Thomson Publishers\nHall,S. Calvin & Garner Lindzey (2007). Theories of Personality(4thEdn. ), John\nWiley & sons: US 137 (H)\nJess Feist and Gregory j Feist ( 2008   ) Theories of personality ,7th edition , McGraw Hill\nReferences:\nDonna M, Ashcraft (2015). Personality Theories Workbook, Cengage Learning,USA. Allen, B. P. (1997). Personality theories: Development, growth, and diversity, (2nded.). London: Alyn and Bacon. Gardner Lindzey, John B. Campbell Calvin S. Hall (2007)."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 3,
    "text": "Gardner Lindzey, John B. Campbell Calvin S. Hall (2007). Theories of Personality (4th Edition), John Wiley & sons\nWeb Sources:\nhttp://www.thetransformedsoul.com/additional-studies/miscellaneous-studies/the-four-human-temperaments\nhttps://sites.google.com/site/psychologyofpersonalityperiod8/home/type-and-trait-theories/sheldon-s-personality-theory\nhttps://www.mindler.com/blog/introverts-extoverts-careers/\nhttps://courses.lumenlearning.com/boundless-psychology/chapter/traitperspectives-on-personality\nhttps://www.psychologistworld.com/cognitive/carl-jung-analytical-psychology\n\nOut of Syllabus- Self Study\nRecent research in personality theories\nStudy about  Zuckermann, Murry,\nKelly- Psychology of personal Constructs\nPersonality profiles of famous personalities\nHistory and childhood experiences of each theorist’s reflections on their conceptual framework and their approach to life. Indian theory on personality\n\n\n\n\n\nCourse Name: RESEARCH METHODS AND APPLIED STATISTICS\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\n\nOBJECTIVES:\nMajor objectives of this course are:\nTo understand the processes of   scientific research. To gain knowledge in ethics in research\nTo explore the use of appropriate research design. To familiarize with various types of sampling techniques\nTo gain knowledge in research report writing\n\nLEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Describe the elements of research, sampling and hypothesis formulation. CO2(K3): Develop research report in APA Style. CO3(K3): Apply knowledge for the selection of appropriate research design. CO4(K4): Analyze ethical issues in conducting a research\nCO5(K5): Explain the steps  in  conducting Psychological research. Lesson - Units\nUnit- I: Foundations of Research -Meaning – Critical thinking process – Objectives of science – Need for research – Research approaches – Steps in research. Method Vs Methodology. General Principles – Ethical issues: Children, Adults, Animals. Research problem – Sources – Criteria of good problem.Reviewing the literature – Research article. Unit- II: Hypothesis,variables and sampling- Hypothesis: Meaning – Types – Basic concepts related to hypothesis testing."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 4,
    "text": "Unit- II: Hypothesis,variables and sampling- Hypothesis: Meaning – Types – Basic concepts related to hypothesis testing. Variables – Definition – Ways of asking questions – measuring observed variables – Scales of measurement – Types of measures – Reliability – Validity. Sampling – Meaning – Probability and Non-probability sampling – Sample &amp; effect size. Data collection methods: Observational research –Survey research. Unit- III: Research Design: Experimental design: Independent groups designs – Completely randomized groups designs, randomized factorial groups design. Dependent groups designs: Within-participants design, matched groups design – Mixed Designs – Single-participant design – Baseline designs. Non- experimental designs: Quasi-experiments – Time-series design, nonequivalent groups designs, longitudinal research, Cross-sectional research, Case-studies, Correlational research. Unit- IV: Statistics: Organizing data: Frequency distribution – Graphs – Descriptive statistics: Measures of central tendency – Measures of variation – Types of distributions. Inferential statistics: z test – t test –Analysis of Variance – Correlation– Concepts related to correlation – Correlation coefficient –Regression. Non-parametric statistics: Mann-Whitney test – Wilcoxon Chi-square – Spearman Rank correlation – Kruskal-Wallis test. Analysis of data using SPSS\n\nUnit- V: Report Writing and computers in research: Writing Proposal – Plagiarism – References and In-text citation – APA primer - Presenting research: Research report – Typing guidelines – Oral and Poster presentation. Computers in research – Internet and research. Learning Resources\nRecommended Text books \nEvans, A.N., &Rooney, B. J. (2011). Methods in psychological research. New Delhi, India: Sage Publications India Pvt. Ltd.\nJackson, S.L. (2015). Research methods and statistics. New Delhi, India: Cengage Learning India Pvt. Ltd.\nKothari, C. R.(2004). Research methodology,(2 nd ed). Chennai: New Age International Publishers. Shaughnessy, J.J., Zechmeister, E.B. &amp;Zechmeister, J.S. (2006). Research Methods in Psychology. (7th ed.). Singapore: McGraw-Hill. REFERENCE BOOKS\n1. Coaley, K. (2009). An introduction to psychological assessment and psychometrics."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 5,
    "text": "An introduction to psychological assessment and psychometrics. New Delhi, India:\nSage Publications India Pvt. Ltd.\n2. Coolican, H. (2009). Research methods in statistics in psychology. New Delhi, India: Rawat\nPublications. 3. Gravetter, F.J., &amp; Forzana, L.A.B. (2009). Research methods for behavioral sciences. Boston, MA:\nWadsworth Cengage learning. 4. Mohanty, B., &amp; Misra, S. (2019). Statistics for behavioural and social sciences. New Delhi, India: Sage\nPublications. 5. Myers, J. (2008). Methods in psychological research. New Delhi, India: Sage Publications. 6. Ruyon, R.P, Haber, A, Pittenger, D.J., &amp; Coleman, K.A. (2010). Fundamentals of behavioural statistics. New York, NY: McGraw Hill. 7. Singh, A.K. (2006). Tests, measurements and research methods in behavioural sciences. Patna, India:\nBharati Bhavan Publishers. Recap\nReviewing of Psychological research done using various research designs, sampling\ntechniques\n\nWeb source:\nhttps://www.sciencedirect.com/topics/psychology/psychological-research\nhttps://opentextbc.ca/researchmethods/chapter/qualitative-research/\nhttps://www.studysmarter.us/explanations/psychology/research-methods-in-psychology/\nhttps://www.verywellmind.com/introduction-to-research-methods-2795793\nhttps://apaformat.org/apa-format-overview/\n\n\nOut of Syllabus: Self Study\n\nDifference Between qualitative and quantitative research\nRecent research in the area of the specialization\nStudents can submit a research proposal in their area of interest\n\n\n\n\n\n\n\n\n\nCourse Name: COUNSELING SKILLS AND TECHNIQUES\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 4\n\nOBJECTIVES:\nThe major objectives of this course are:\nTo acquire knowledge about skill based models of counseling. To examine the ethical issues in counseling\nTo understand the skills and process of online counseling. Practice the skills of attending, listening and responding with empathy using classroom activities and exercises. To understand one’ strengths and limitations in basic counseling skills."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 6,
    "text": "To understand one’ strengths and limitations in basic counseling skills. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Discuss the process of counseling offline and online and ethical issues. CO2(K3): Explain the basic counseling skills of listening, responding , challenging and formulating action plans. CO3(K4): Identify and differentiate skills at different stages of Counseling. CO4(K5): Evaluate the various counseling approaches that are skill based. CO5(K6): Apply the skills of counseling through classroom activities and practicum\n\n\nLesson - Units\nUnit- I: Counseling Skills and Ethical Issues: The Helping relationship and process. Specific Counseling skills: Understanding the internal frame of reference, showing attention and interest, paraphrasing and reflecting feelings, structuring, probing, monitoring, challenging, self-disclosing. Managing resistances and making referrals. Facilitating problem solving. Improving client’s perceptions, negotiating homework, conducting middle sessions and terminating helping. Ethical and Legal Issues in Counseling\n\nUnit- II: The Skill Based Models of Counseling: Egan’s problem management approach to helping. Stage I Problem clarification, Stage II Setting goals based on dynamic understanding, Stage III Facilitating action. Ivey and Ivey’s Step by Step Micro skills model- Towards Intentional interviewing and Counseling. The Micro skills hierarchy. Drawing out client stories. Relationship-Story and Strengths- Goals- Restory- Action. Increasing skills and flexibility. Theory and Microskills. Unit- III: Listening & Empathy Building: Qualities of the Effective Listener: Positive & Negative Listening– Proximity in Listening–Using Silence – Head nodding – Facial Expressions – Active Listening – Distraction –Assessing your own Listening. Clarifying empathy– Empathy building Statements–People who empathize –Simple reflection of content – Simple reflection of feeling – Selective reflection – Putting it all together – Using Empathy in everyday life – Empathy in difficult situations–Ethical issues \n\nUnit- IV: Activities in Counseling: Information Activities: Types of information – Pros and cons of advice-giving – Breakingbad news – Confrontation I – Confrontation II – Checking for understanding. Facilitation Activities: Exploring facilitation – Types of facilitation– Learning to facilitate – Group facilitation – Limits to facilitation – Dealing with contingencies."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 7,
    "text": "Facilitation Activities: Exploring facilitation – Types of facilitation– Learning to facilitate – Group facilitation – Limits to facilitation – Dealing with contingencies. Problem Solving Activities: Types of problem– Identifying problems– Problem- Solving Cycle–Clarifying Problems– Dealing with problems – Planning – Evaluation of Problem solving. Coping with Feelings: Types of feelings – Feeling words – Expressing feelings – Dealing with Paradox - Focusing –Preventing Burnout–Coping with \nstress\n\nUnit- V: Online Counseling Skills: Establishing an online presence and online relationship, online expression and listening, establishing and maintaining an open dialogue. Professional considerations in online practice. Technological advances: Implications for Counseling Psychological research, training and practice Practicum: To practice basic skills of listening,responding,empathizing and summarizing in the classroom under supervised guidance. Recap: Conducting quiz, class test, assigning students to do review sessions, “Question hour”\n\nLearning Resources:\nRecommended Textbooks:\nEgan, G. (2019).The skilled helper: A problem-management and opportunity- development approach to helping, 11 th edition. Pacific Grove, CA: Brooks/Cole\nBrown, S.D., & Lent, R.W. (2008).Handbook of counseling psychology (4 th Ed) Edison, NJ: John Wiley &amp; Sons, Inc.\nEvans, J (2009) Online Counseling and Guidance Skills: A resource for trainees & practitioners, 1 st Edition, Sage Publications India Pvt. Ltd., New Delhi\nIvey, A.E., Ivey, M.B.,&amp; Zalaquett, C.P.(2018). Intentional interviewing and counselling. 9 th edition. Belmont, CA: Brooks/Cole Cengage learning Pub. Co.\nFeltham, C.,& Horton, I. (2017).The SAGE handbook of counseling and psychotherapy (4th ed. ).Los Angeles, CA: Sage Publications Pub. Co.\nNelson–Jones, R. (2011). Basic counseling skills: A helper’s manual (2 nd Ed.). Chennai, India: Sage Publications India Pvt. Ltd.\n\nReferences: \nBurnard, P. (1995). Counseling skills training: A source book of activities for trainers. London, England: Kogan Page Ltd.\nNelson-Jones (2010)."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 8,
    "text": "London, England: Kogan Page Ltd.\nNelson-Jones (2010). The theory and practice of counseling and Therapy (5th ed). Sage. Meier,A.&Boivin,M. (2010), Counseling & Therapy Technique, Theory and Practice (Sage)\nThompson,R.A.(2016). Counseling Techniques-Improving relationships with others, ourselves, our families, and our environment, 3rd ed. Routledge. Web resources\nhttps://www.apa.org/education-career/ce/beyond-microskills.pdf\nhttps://cognella-titles-sneakpreviews.s3-us-west-2.amazonaws.com/82967-1A-URT/82967-1A_SP.pdf\n\nOut of Syllabus: Self Study\nCross-cultural differences in counseling\nCounseling in the Indian context\n\n\nSEMESTER II- CORE\nCourse Name: PSYCHOMETRY\nCourse Code:\nYear and Semester:     Thirdyear ,th Semester\nCredits : 5\n\n\nOBJECTIVES:\nThe major objectives of this course are:\n1. To understand the steps in construction of Psychological tests. 2. To gain knowledge of the procedures in standardization and development of norms. 3. To describe item writing procedures for different types of tests. 4. To explain item analysis procedures used in test construction\n5. To understand ways to minimize error in test construction. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Describe the steps in test construction and standardization\nCO2(K3): Explain the requirements of item writing and methods in item analysis\nCO3(K4): Analyze test construction principles for different types of tests. CO4(K5): Summarize test standardization procedures such as reliability, validity and  development of norms. CO5(K6): Plan test construction and/or standardization procedures for hypothetical tests\n\n\n\nLesson - Units\nUnit- I: The science of psychometrics. Psychometrics in the 21st century. Defining the test– Classification of tests – Characteristics of standardized tests. Scaling-Selecting a scaling method. Representative scaling methods. Criterion referenced tests and norm referenced tests. Unit- II: Construction of Intelligence Tests: Item writing for Intelligence tests: Analogies, odd-man-out, sequences. Tests of ability and attainment: Content of items, multiple choice items."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 9,
    "text": "Tests of ability and attainment: Content of items, multiple choice items. Advantages of multiple choice items.True-false items, matching items, choosing the item type. Other item types, arrangement of items for a test trial, guessing. Constructing Personality Inventories- Problems in constructing personality Inventories. Writing items for personality Inventories: item forms, guidelines for item writing. Eliminating response sets. Item content. Unit- III: Construction of Other Types of Tests: Objective tests: Advantages, principles, stimulus-instruction situation, and response scoring parameters. Distinction between objective tests of ability, temperament and dynamics. Practical hints for objective test construction in personality and motivation. Differential Activation of different subjects. The influence of ability and achievement on objective test scores. Group vs Individual tests. Objective test dimensions.Projective Tests-construction of projective tests. Item writing for mood and state scales. Attitude measurement: types of attitude scales. Unit- IV: Item Analysis: Important variables for item analysis. Two indices in item analysis- correlations of items and the total score, choice of item –analytic statistics.Item scoring and item analysis-Itemdifficulty, Item discrimination, Item response theory. Selection of items after item analysis. Re-writing items.Failure to form a test. Unit- V: Test Standardization: An overview of the different types of reliability and validity. Factors affecting reliability and validity- Generalizability of test scores. Norms- Meaning and purpose of norms. Raw score transformation.Percentile And Percentile Ranks, Standardized scores. Normalizing standard scores .T scores, stanines, sten scores and C-Scale. Selecting a norm group--age and grade norms. Local and sub group norms..Practical difficulties in test construction. Recap: \nConducting quiz, class test, assigning students to do review sessions, “Question hour”\n\nRecommended Textbooks\nKline,P. (2015).A handbook of test construction: Introduction to psychometric design. NewYork, NY:Methuen. Schultz,K. S., Whitney,D.J. &Zickar,M.J."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 10,
    "text": "&Zickar,M.J. (2021) Measurement theory in action-Case studies & Exercises,(3rd ed), Routledge, New York, Taylor &Francis\nRust,J.,Kosinski,M., Stillwell,D,(2021).Modern psychometrics: The science of psychological measurement(4th edn)\n\nReferences\nAnastasi,A.,& Urbina, S.  (2017). Psychological testing. (7thed). Chennai, India: Pearson India Education Services, Pvt.Ltd. Gregory,R.J. (2017).Psychological testing. (7thed.). Chennai, India: Pearson India Education Services Pvt. Ltd. Husain,A.(2012). Psychological Testing.Noida, India:DorlingKindersley(India)Pvt.Ltd\n\nWeb references\nhttps://files.eric.ed.gov/fulltext/EJ1083861.pdf\nhttps://www.egyankosh.ac.in/bitstream/123456789/73590/3/Unit-9.pdf\n\nOut of Syllabus: Self Study\nConstructing own questionnaire and suggesting suitable methods of standardization. To follow steps given in Modern Psychometrics by Rust\n\nCourse Name: BEHAVIOR MODIFICATION\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\nOBJECTIVES:\nThe major objectives of this course are:\nLearn the terminology, procedures, and techniques of Behavior Modification\nEquip students to apply these principles within the real-world environment. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Demonstrate knowledge of the basic principles and techniques in operant and classical conditioning. CO2(K3): Apply the behavioral model to the procedure and practical applications of various techniques to establish new behaviors\nCO3(K4): Distinguish between behavior modification techniques to increase desirable behavior and decrease undesirable behavior, and their practical applications\nCO4(K4): Distinguish between behavior modification techniques for anxiety induction and anxiety reduction, and their practical applications\nCO5(K5): Recommend individualized behavior modification plans based on the various techniques learnt\n\n\n\n\n\n\nLesson - Units\nUnit- I: Basic Concepts: Definition and characteristics of behavior modification: Historical aspects. Areas of application. Reinforcement - positive and negative reinforcement, escape and avoidance behaviors, conditioned and unconditioned reinforcers, factors that influence the effectiveness of reinforcement, schedules of reinforcement."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 11,
    "text": "Reinforcement - positive and negative reinforcement, escape and avoidance behaviors, conditioned and unconditioned reinforcers, factors that influence the effectiveness of reinforcement, schedules of reinforcement. Punishment - positive and negative punishment - Factors that influence the effectiveness of punishment. Respondent conditioning, timing of neutral and unconditioned stimulus, higher order conditioning, conditioned emotional responses, extinction of conditioned responses, discrimination and generalization of respondent behavior, Influential factors of respondent conditioning. Introduction to a functional behavioral analysis. Basic behavioral principles of the A-B-C  contingency .Formal behavioral assessment. A brief look at the areas of application. Unit- II: Procedures to Establish New Behaviours: Stimulus control: discrimination and generalization. Defining stimulus control, stimulus discrimination training, the three-term contingency. Generalization, Shaping and its applications - How to use shaping, shaping of problem behaviors. Prompting and fading techniques. Types of prompts. How to use prompting and transfer of stimulus control (for example in autism). Chaining . Examples of behavioral chains, analyzing stimulus-response chains, task analysis, backward chaining, forward chaining, total task presentation. Chaining Components of behavioral skills training procedures. Modeling, instructions, rehearsal, feedback. Unit- III: Procedures to Increase Desirable Behavior and Decrease Undesirable Behavior: Differential reinforcement of alternative behavior, differential reinforcement of other behavior-Differential reinforcement of low rates of responding. Antecedent control procedures. Using antecedent control strategies. Using punishment. Timeout, Response Cost. Unit- IV:  Other Behavior Change Procedures\nToken economy, practical considerations, implementing a token economy, applications of token economy, advantages and disadvantages of a token economy. Behavioral contract, components of a behavioral contract. Cognitive behavior changes procedures, Thought stopping. Introduction to third wave therapies–Dialectical Behaviour therapy, Metacognitive therapy. Unit- V: Overview of Assessment, Formulation and Intervention in Clinical Conditions:\nClinical Conditions– Depression, panic, OCD, GAD, eating disorders, PTSD. Anxiety reduction procedures – Defining fear and anxiety problems, procedures to reduce fear and anxiety–relaxation, systematic desensitization, in-vivo desensitization. Anxiety induction procedures – implosive therapy flooding, aversive counterconditioning –use of electric shock, covert sensitization."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 12,
    "text": "Anxiety induction procedures – implosive therapy flooding, aversive counterconditioning –use of electric shock, covert sensitization. Recap: Conducting quiz, class test, assigning students to do review sessions, “Question hour”\n\nRecommended Textbooks\nMiltenberger, R.G. (2016). Behavior modification: Principles and procedures. (6th ed.).Boston,MA:WadsworthCengageLearning. Masters, J. C., Burish, T. G., Hollon, S. D., &Rimm, D. C. (1987). Behavior Therapy: Techniques And Empirical Findings. (3rded. ).NewYork,NY: Harcourt Brace Jovanovich College Publishers. References:\nKanfer, F.H., &Saslow, G. (1965). Behavioral analysis: An alternative to diagnostic classification.Archives Of GeneralPsychiatry,12(6),529-538. Simos, G. (2002).Vol I &II Cognitive behavior therapy: A guide for the practicing clinician (Vol1)London, England:Brunner-Routledge. Web resources\nhttps://in.sagepub.com/en-in/sas/behavior-modification/journal200900#description\nhttps://onlinecourses.swayam2.ac.in/cec22_ed04/preview\n\n\n\nSelf- study component\nObservation of videos of case studies using different methods of behavior modification\nAn overview of strategies to promote generalization in behavior change. Assertiveness training\n\n\nCourse Name: PSYCHOLOGICAL ASSESSMENT – I\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 4\n\nOBJECTIVES:\nThe major objectives of this course are:\nTo assist in the selection of appropriate tests. To develop competence in Various types of Psychometric tests\nTo Administer psychological test according to the guidelines\nTo understand and interpret the person’s test scores\nTo understand and solve the ethical issues in Psychological assessment. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Explain the  conceptual framework of psychological testing. CO2(K2): Identify the appropriate psychological test\nCO3(K3): Determine how to discuss the obtained individual data. CO4(K4): Evaluate the ethical issues in psychological testing. CO5(K6): Infer the Individual differences through psychological testing."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 13,
    "text": "CO5(K6): Infer the Individual differences through psychological testing. At least 10 tests have to be conducted from the following list: \n1. Raven’s progressive matrices\n2. Weschler’s Adult Intelligence\n3. Differential Aptitude tests\n4. Adolescent Interest scale\n5. David's Battery of Differential aptitude test III\n6. Myers Briggs Type Indicator (MBTI)\n7. Cattell’s 16 Personality Factor Questionnaire (16PF)\n8. Multiple Anxiety Inventory\n9. Beck Depression Scale\n10. Memory Scale\n11. Assessment of Learning disability\n12. Career maturity\n13. Assertive Questionnaire\n14. Students Stress Scale\n15. Marital Adjustment Questionnaire\nRecap :The test can be discussed along with the process of construction and validation\nRecommended Textbooks:\nAnastasi. A. &Urbina.S. (2002), Psychological testing, 7th Edition, Pearson Education, USA\nGregory.R.J. (2005). Psychological testing, history, principles and applications. 4th Edition, Pearson Education, USA. Reference:\n1. Freeman, G.B. (1971) Theory and Practice of Psychological testing . New Delhi : Oxford and IBH Publishing Co.\n2. Kaplan, R.M &Saccuzzo, D.P (2007). Psychological Testing. Delhi: Cengage Learning India. 3. Singh, A.K. (2004). Test Measurements and Research Methods in Behavioural Sciences. Patna: Bharat Bhavan Publishers and Distributors. Web resource:\nhttps://www.psychologydiscussion.net/essays/essay-on-the-uses-of-psychological-test/742\nhttps://www.youtube.com/watch?v=6HtnBBmuZpI\nhttps://www.verywellmind.com/psychometric-properties-425262\nSelf study:\nStudents can refer the psychological research done using the above test\nThey can conduct a research study using the tests . SEMESTER III- CORE\nCourse Name: APPLIED SOCIAL PSYCHOLOGY\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\n\nOBJECTIVES: - \nMain objectives of this Course are:\nTo understand the key issues and theoretical concepts of applied social psychology and examine the roles of applied social psychologists."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 14,
    "text": "SEMESTER III- CORE\nCourse Name: APPLIED SOCIAL PSYCHOLOGY\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\n\nOBJECTIVES: - \nMain objectives of this Course are:\nTo understand the key issues and theoretical concepts of applied social psychology and examine the roles of applied social psychologists. To analyze the intricacies underlying the theories of attribution and social cognition and to gain insight in the formation of attitudes and analyze its impact on behavior. Examine the causes of prejudice and explore techniques to prevent them. To gain an understanding on the cognitive, affective and behavioral process of individuals as influenced by group interaction. To understand the applications of applied social psychology to social issues in the field of media, legal system, politics, work settings, community, health and environment. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1 Delineates the theoretical concepts of applied social psychology and appraise the role of applied social psychologist. CO2 Explain the attribution concept and relate the information in social context to explain and predict others behavior. CO3 Explore the influence of social indicators on the formation of attitude and examine the attitude- behavior relationship. CO4 Demonstrate ability to articulate about group behavior, prejudice and its influence on individuals’ behavior. CO5 Apply the principles of social psychology in various fields like media, legal system politics, work settings, community, health and environment. Lesson - Units\nUnit- I: Introduction: Definition of Social Psychology and Applied Social Psychology, Historical Context of Applied Social Psychology, Research Methods in Applied Social Psychology, Role of Applied Social Psychologists. Unit- II: Understanding Others & Social Cognition: Nonverbal Communication: Basic Channels, Recognizing Deception. Attribution: Theories, Basic sources of error, Applications. Impression Formation &amp; Impression Management: Asch’s Research, Cognitive perspective. Social Cognition- Schemas, sources of error in social cognition. Unit- III: Attitude & Prejudice: Attitude: Meaning – three components – Attitude Formation: Social Learning, Genetic Factors, Attitude Functions, Attitude- Behavior link. Persuasion: The Early Approach &amp; the Cognitive Approach. Attitude Change: Cognitive Dissonance – Attitude scales. Prejudice:Nature,Sources,Consequences,Techniques for minimizing prejudice."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 15,
    "text": "Prejudice:Nature,Sources,Consequences,Techniques for minimizing prejudice. Unit- IV: Group Dynamics & Leadership: Group: Nature, functions, types of group, theories of group formation, Social facilitation, Social loafing, Group Think, Influence of minority. Leadership: Meaning – three major types – functions – theories – Nature and impact in groups, Gender differences, Leader effectiveness, Transformational, transactional and other types of leadership. Unit V: Applying Social Psychology to arenas of life and to one's own life: Applying social psychology: In Media, Legal System, Politics, Work settings, Community/Culture, Health and Environmental Psychology, social neuroscience Applying social psychology to personal relationships, to classroom and to good life - balance optimism and pessimism. Recommended texts\nRobert A. Baron &amp; Nyla R. Branscombe, Social Psychology, 13 th Edition, Pearson Education. David G. Myers, Prem Sahajpal, Pushpita Behera. (2012) Social Psychology, 10 thEdition,McGraw Hill Education(India) Private Limited. Robert S. Feldman, (2001). Social Psychology 3 rd Edition, Pearson. References:\nSchultz, W., Oskamp.S (2000). Social Psychology: An applied perspective, Upper saddle River, NJ Prentice Hall. Frank W.Schneider., Jamie A. Gruman., Larry M.Coutts. (2005) Applied social Psychology- Understanding and Addressing Social and Practical Problems, Sage publications. Gruman J, A,: Schneider, F. W. &amp; Coutts, L.M. (2017). Applied Social Psychology:Understanding and Addressing Social and Practical problems. 3ed edition. New Delhi: Sage Publications. Web resources\nhttps://www.youtube.com/watch?v=9VlWm6OJA4k scope of social psychology in India\nhttps://www.youtube.com/watch?v=tcvouz1v12M social psychology\nOut of Syllabus: Self Study\nDevelop a semi structured interview schedule and conduct an attitude survey\n\n\n\nCourse Name: ADVANCED COGNITIVE PSYCHOLOGY\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\nOBJECTIVES: - \nMain objectives of this Course are:\n1. To develop an understanding of Cognitive Neuropsychology\n2. To give orientation about different methods in cognitive neuroscience\n3."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 16,
    "text": "To give orientation about different methods in cognitive neuroscience\n3. To explain brain structure and functions\n4. To develop the concept behind the neurological functions of sensory, motor, attention and memory\n5. To provide the understanding of brain functions related to executive functions, emotions and social cognition\n\nLEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K1): Recognize the importance of cognitive neuropsychology and its connections to human behavior\nCO2(K2): Explain about various methods in cognitive neuroscience and its applications\nCO3(K2): Understand the structure and functions of brain and its application in understanding various disorders\nCO4(K4): Discuss the importance of cognitive bases of perception and the neural bases of sensory motor functions\nCO5(K3): Explain the neural background for higher order cognitive functions, such as attention, language, executive functions, learning and memory, consciousness and emotion regulation. Lesson - Units\nUnit- I: Introduction to cognitive neuropsychology–  Brief History of cognitive neuroscience –  Present and existing future of cognitive neuroscience,  experimental approaches to Brain functions- localization and lateralization overview of methods in cognitive neuroscience -  Invasive  and  noninvasive methods. Unit- II: Introduction to  brain- Structure and functions of the Neuron,  Brain Anatomy and functions-  the gross organization of the brain- lobes,  cerebrum-  cerebral cortex-  subcortex-  midbrain- hindbrain- connectivity of the brain- neurotransmitters and hormones. Unit- III: Memory and Language:  Working Memory – Process of Forgetting – Memory Distortions – Reconstructive Retrieval – Recovered Memory – Memory Illusion – False Memory – Eyewitness Testimony – Approaches to Memory- Information processing & connectionist."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 17,
    "text": "Unit- III: Memory and Language:  Working Memory – Process of Forgetting – Memory Distortions – Reconstructive Retrieval – Recovered Memory – Memory Illusion – False Memory – Eyewitness Testimony – Approaches to Memory- Information processing & connectionist. Defining Language – Origin of Language – Meaning, Structure and Use – Universal Language –  Language acquisition, models of reading and language comprehension; Meaning and beyond; Language production\n\nUnit- IV: Problem Solving  and reasoning: Types of Thinking – Well Defined and Ill-Defined Problems – Productive and Reproductive Problems – Model of Problem Solving - Reasoning and Decision Making – Categorical Syllogism – Conditional Syllogism – Errors in Deductive Thinking – Theories of Deductive Reasoning – Syllogistic Reasoning, Syllogistic Forms – Common Errors – Conditional Reasoning – Inductive Reasoning – General Inductions – Specific Inductions\n\nUnit- V: Neuropsychological tests – principles of neuropsychological assessment- rationale and goals (orientation sensation, perception attention and concentration, motor skills, verbal functions and languages) overview of neuropsychological battery- domains and measures of tests- HalsteradReitan, luria Nebraska, PGI BBP, NIMHANS battery\nRecap: Importance of cognitive- neuro- psychology , structure and functions of brain- neural basis for sensory, motor, attention, speech and language functions, memory, forgetting, reasoning, problem solving and decision making, Social and emotional cognition. Learning Resources:\nRecommended Text Books:\nJamie Ward (2015), “The Student’s Guide to Cognitive Neuroscience”- Third Edition, Psychology Press, London NewYork\nBaddley, A. (1997). Human memory: Theory and practice. New York: Psychology Press. Harley, Treror, A. (2002). The psychology of language: From data to theory. Taylor Francis. Smith, E.E. &Kosslyn, (2007). Cognitive psychology: Mind and brain. Prentice Hall. Tripathi, A.N. &Babu, Nandita (2008). Cognitive processes. In Misra, G. (Ed.). Psychology in India: Advances in Research, Vol. 1. New Delhi: Pearson Education."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 18,
    "text": "New Delhi: Pearson Education. Liro P. Jaaskelainen (2015),”Introduction to Cognitive Neuroscience” – bookboon.com\n\nReferences:\nKellogg, R. (2016). Fundamentals of cognitive psychology. Thousand Oaks: SAGE Publications. Smith, E., Kosslyn, S., &Barsalou, L. (2008). Cognitive psychology. New Delhi [India]: Prentice Hall of India. Sternberg, R., & Sternberg, K. Cognitive psychology (7th ed.). Wadsworth Publishing. Groom , D. (2014) . An Introduction to Cognitive Psychology - Processes and Disorders. USA: Psychology Press. Reed, S. K. (2010). Cognition - Theories and Applications  . UK: Wadsworth Cengage Learning. Web Sources:\nhttps://www.youtube.com/watch?v=EtxibYcyDz0\nhttps://www.youtube.com/watch?v=plm9tmkOV88\nhttps://www.youtube.com/watch?v=ZudHhIDG3M4\nhttps://www.youtube.com/watch?v=kVollCt4_dQ\nhttps://www.youtube.com/watch?v=gdzmNwTLakg\nhttps://www.youtube.com/watch?v=tFHL1_DStY8\nOutside Syllabus: Self Study\nTrends in cognitive neuroscience research\nHemispheric Specialization\nBrain damage and neurological disorder\nNeuroimaging and EEG\nReflection of Neurological issues in cognition , affect and action\nSocial Cognition. Personality. Evolutionary Psychology and brain\nCourse Name: PSYCHOLOGICAL ASSESSMENT – II\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 5\n\nOBJECTIVES: - \nMain objectives of this Course are:\nTo gain knowledge in assessment used at workplace\nTo familiarize with  Psychometric properties of  tests\nTo Administer psychological test according to the guidelines\nTo understand and interpret the person’s test scores\nTo understand and solve the ethical issues in Psychological assessment. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Explain the  application of  psychological testing at work place ."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 19,
    "text": "LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Explain the  application of  psychological testing at work place . CO2(K2):  Identify the appropriate psychological test  in recruiting and managing employees\n CO3(K3): Determine how to discuss the obtained individual data and write a report\n CO4(K4): Evaluate the ethical issues in psychological testing. CO5(K6): Infer the Individual differences through psychological testing. At least 10 tests have to be conducted from the following list\n1. Communication Skills Assessment\n2. Emotional Intelligence\n3. Work Motivation\n4. Organizational Commitment\n5. Job Involvement\n6. Organizational  Stress\n7. Fundamental Interpersonal Relationship Organization Behavior\n8. Work Motivation Questionnaire (WMQ)\n9. Conflict Style Inventory\n10. Managing by Motivation\n11. Daftuar Types at Work (DTAW)\n12. Leadership Effectiveness Scale\n13. Employee Engagement Scale\n14. Working Styles Assessment\n15. Organization Effectiveness Scale \nRecap: The test can be discussed along with the process of construction and validation\nRecommended Text Books:\nAnastasi. A. &Urbina.S. (2002), Psychological testing, 7th Edition, Pearson Education, USA\nGregory.R.J. (2005). Psychological testing, history, principles and applications. 4th Edition, Pearson Education, USA. References:\nFreeman, G.B. (1971) Theory and Practice of Psychological testing . New Delhi : Oxford and IBH Publishing Co.\nKaplan, R.M &Saccuzzo, D.P (2007). Psychological Testing. Delhi: Cengage Learning India. Singh, A.K. (2004). Test Measurements and Research Methods in Behavioural Sciences. Patna: Bharat Bhavan Publishers and Distributors. Web resources:\nhttps://www.psychologydiscussion.net/essays/essay-on-the-uses-of-psychological-test/742\nhttps://www.youtube.com/watch?v=6HtnBBmuZpI\nhttps://www.verywellmind.com/psychometric-properties-425262\n\nOutside Syllabus: Self Study\nStudents can refer the psychological research done using the above test\nThey can conduct a research study using the tests ."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 20,
    "text": "Web resources:\nhttps://www.psychologydiscussion.net/essays/essay-on-the-uses-of-psychological-test/742\nhttps://www.youtube.com/watch?v=6HtnBBmuZpI\nhttps://www.verywellmind.com/psychometric-properties-425262\n\nOutside Syllabus: Self Study\nStudents can refer the psychological research done using the above test\nThey can conduct a research study using the tests . SEMESTER-III: INDUSTRIAL MODULE\n\nCourse Name: PSYCHOLOGICAL TRAINING MODULE\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\nOBJECTIVES: \nMajor objectives of this course are:\nTo help students understand the method of preparing Psychological Training Modules using counseling techniques. To design customized training module for various target groups\nTo utilize the psychological principles in constructing training module\nTo apply psychological interventions in bringing constructive change in thinking, affect and behavior\nTo help students acquire necessary skills to conduct Training Programmes\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nConduct needs assessment and prepare the concept background for the training programme. Design a psychological training module with the detailed planning and structuring of a course to achieve specific instructional goals. Infer a better understanding of practical knowledge, skills and attitude to conduct training programmes. Adapt specific psychological techniques into a training module. Analyze and design appropriate assessment and evaluation tools that accurately reflect the results of the training module. METHOD: This paper is an extension of the theory paper Training and Development (PAPER XX - MP / ID / 306 – INTER DISCIPLINARY, CREDITS 3) offered in the third semester. The Modules chosen by the students from the list given below will be oriented to the students in one or two (few) sessions. Each Student has to develop 6 modules under the guidance of a supervisor (out of which 3 will be from self-help skills topics found below and 3 from interpersonal skills topics) using psychological concepts and counseling techniques (BMT, CBT, REBT, etc could be used)  for specific target populations. Students are expected to submit a project report about the training procedures."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 21,
    "text": "Students are expected to submit a project report about the training procedures. SELF-HELP SKILLS (Practical Oriented Teaching)\nSelf-Awareness\nStress Management & Relaxation Training\nSelf-Concept, Self Esteem Skills\nAssertiveness skills\nAnger management\nDiary keeping and self-analysis\nGoal setting behaviors\nTime management skills\nPhysical disciplines - Exercise, etc. Reading skills\nCoping with Complexity And ambiguity\nCoping Emotions\nCoping with failures\nCreative thinking\nSelf-efficacy skills\n\n\n\nINTERPERSONAL SKILLS (Practical Oriented Teaching)\nCommunication Skills (Styles)\nFacilitation and Moderation Skills. Conflict management\nProblem solving and Decision Making\nMotivation and Leadership Skills\nPeer Counselling\nRelationship Skills (also with reference to opposite sex and Martial relationship)\nEvent Management Skills\nTeam Building\nEmpathy and interpersonal relationship skills\nNegotiation and confrontation skills\nLearning Resources:\nRecommended text books:\nAgochiya, D. (2002). Every trainer's handbook . Sage Publications . Tony Bray (2012) The training Design manual the Complete Practical Guide to Creating Effective & Successful training programmes , Kogan\nBlanchard, N. P. &Thacker, J. W. (2009).Effective training: systems, strategies and practices, Pearson Education. References:\nHackett, P. (1998).Introduction to training, University Press India Ltd.\nColvin Clark  (2010).Evidence-Based Training Methods: A Guide For Training Professionals 2nd Edition. Elaine Biech (2015). Training and Development for Dummies, John Willey & Sons Ltd.\nRolf P. Lynton and UdaiPareek's( 2011). Training for Development,3rd Edition, Sage Publications. Burnard, P. (1999). Counselling skills training – A sourcebook of activities for trainers, Viva Books Private Limited. Course Name: HUMAN RESOURCE MANAGEMENT\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 4\n\nOBJECTIVES: - \nMain objectives of this Course are:\n1. To introduce the fundamental concepts of the HR Department and its structure, personnel policies and principles. 2. To enable the students to learn the process and the sources of planning, recruitment, selection and identify appropriate performance appraisal methods. 3. To impart skills in designing training and development programs and explain the maintenance of Human Resources. 4."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 22,
    "text": "4. To understand the appraisal process and methods. 5. To investigate the causes of stress and describe the models of stress. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K1): Define and describe human resource management. CO2(K3): Examine the process and sources of recruitment. CO3(K4): Analyze the techniques of training. CO4(K5): Evaluate the different types of rewards. CO5(K6): Discuss the legal benefits and services provided by organizations. Lesson - Units\nUnit- I: Introduction to Human Resource Management- Scope- Objectives of human resource management-Structure and functions of human resource department - Image and qualities of HR managers - Evolution of human resource management –Personnel policies and principles –Human resource management model. Unit- II: Acquisition of Human Resources- Human resource planning and forecasting - Job analysis - Job description and Job specification-Process and sources of recruitment-Selection process. Unit- III: Development of Human Resources- Training and development– Designing training and development programme- Methods and techniques of training- Evaluation of training program. Unit- IV: Motivation of Human Resources -Job design work scheduling and motivation-Job characteristics model- Job enrichment- Job rotation- Work modules- Flextime-New trends in work scheduling. Performance Appraisal – Appraisal process - Appraisal methods – Factors distorting appraisals. Rewarding the productive employee -Types of rewards-Qualities of effective rewards- Criteria for distribution of rewards. Unit- V: Maintenance of Human Resources- Benefits and Services-Legal benefits and services provided by organizations. Disciplining the problem employee. Safety and health- The occupational safety and health act. Safety programme- Causes of accidents- Preventive measures. Health programmes- Causes of stress - A model of job stress - Causes of burnout – Reducing burnout. Recap: Image and qualities of HR managers, Designing training and development programme, Factors distorting appraisals, Causes of accidents. Learning Resources:\nRecommended Texts:\n1. Decenzo, D.A.,Robbins-D. A.,Verhulst,L.S. (2015).HumanResourceManagement(11th ed) India:Wiley. 2. Aswathappa K. (2006). Human Resource and Personnel Management (4th ed.). New Delhi:Tata McGraw Hill Publishing company limited. 3."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 23,
    "text": "3. Dessler D. &amp;Varkkey B.,(2017). Human Resource Management, (16th ed.) India :Prentice,Hall Private Limited\nReferences:\n1.Mamoria-C. B (2007). PersonalManagement, Twelfth edition, Mumbai : Himalaya Publishing House\n2. Durai.P.(2020). Human Resource Management (3rd ed).India: Pearson Education. 3. Decenzo - D.A. - Robbins - D. A. (2007). Personnel/ Human Resource Management India: Prentice-Hall Private Limited. Web sources:\nhttps://www.economicsdiscussion.net › personnel-policies- Personnel Policies: Meaning, Definitions, Types, Importance\nhttps://www.toppr.com › human-resource-management- Recruitment Process : HRM, External and Internal Sources\nhttps://safetyculture.com › Topics- The Process of Evaluating Training Programs – Safety Culture\nhttps://kitaboo.com › training-evaluation-evaluate-training- 5 Best Ways to Evaluate Training Effectiveness and Impact\n\nOutside syllabus- Self Study\nEqual employment opportunity\nCareer development. Research in Human Research Management. Course Name: COMMUNITY PSYCHOLOGY\n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 4\n\nOBJECTIVES: - \nMain objectives of this Course are:\nTo understand the important concepts in community Psychology. To understand the fields of community psychology. To describe the various preventive measures that can be adopted in the community. To explain ways to provide supportive measures in the community and psychological first aid in cases of traumatic stress. To analyze ways in which community and social change can be facilitated. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Describe the concepts of Community Psychology\nCO2(K3): Explain the importance of working with the Community\nCO3(K4): Classify the community interventions and psychological first aid. CO4(K5): Investigate on the needs of the community \nCO5(K6): Recommend strategies for proper implementation of community psychology projects. Lesson - Units\nUnit- I: Introducing Community Psychology: History of community psychology. Aims of community research. Methods of community psychology research. Understanding individuals within environments and the community\nUnit- II: Preventing problem behavior and promoting social competence:  Understanding the key concepts of prevention and promotion. Ways to implement programs."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 24,
    "text": "Ways to implement programs. Unit- III: Promoting community and social change: Citizen participation and empowerment. Program evaluation and program development. Unit- IV: Community based psychological first aid: Introduction. On being a helper in providing CBPFA. Traumatic stress.-emotional, physical, behavioral and cognitive reactions to stress. Stress of disasters. Coping with stress. CBPFA with marginalized and rural communities. Unit -V: Group service learning project on a community related issue: Skill training exercises for the students. Recap: Conducting quiz, class test, assigning students to do review sessions,“Question hour”\n\nLearning Resources \nRecommended Text Books\n1. Thomas, E., Kloos B., Hill J., Wandersman A., Elias M.J. & Dalton, J.H. (2012) Community Psychology: Linking Individuals and Communities, 3rd Edition. Wadsworth Publishing. 2. Jacobs,G.A. (2016) Community based Psychological first aid -- A Practical Guide to Helping Individuals and Communities During Difficult Times, Elsevier,Ltd. References:\n1. Johnson, D.W. (1986) Reaching out interpersonal effectiveness and self-actualization, 3rd edition. New Jersey: Prentice Hall. 2. Johnson, D.W. & Johnson F.P. (1982) Joining together, 2nd Edition. New Jersey: Prentice Hall. Web References:\nwww.springer.com\nwww.gicpp.org\nwww.scrahl.org\nOutside syllabus- Self Study\nSocial Issues and community based interventions relevant to the Indian  context."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 25,
    "text": "Web References:\nwww.springer.com\nwww.gicpp.org\nwww.scrahl.org\nOutside syllabus- Self Study\nSocial Issues and community based interventions relevant to the Indian  context. Course Name: DISSERTATION\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\nOBJECTIVES: \nMajor objectives of this course are:\nIdentify the  research problem on the basis of relevant literature review \nAdopt appropriate research design to undertake the research study\nApply research methodology in selection of sample, finalization of tools for research\nCollect data and analyze the results\nPresent the research work in the form of dissertation\n\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Identify gap in knowledge in existing literature\nCO2(K3): Apply appropriate sampling techniques and research design\nCO3(K2): Choose appropriate psychological tools for data collection\nCO4(K6): Design an research plan and carry out a independent research\nCO5(K6): Prepare a research report\n\n\n\nSUGGESTED FORMAT FOR DISSERTATION\nLesson - Units\nUnit- I: Introduction :\nConceptual Framework / Theoretical Framework\nNeed of the study\n\nUnit- II: Review of Related Literature (Last ten years)\nIntroduction (Brief)\nStudies on variables, sample and related variables and samples\nCritical analysis of reviews collected\n\nUnit- III: Method of Investigation\nIntroduction\nStatement of the Problem\nObjectives\nHypotheses\nResearch Design (Methodology)\nSample (Sample, Sample Size, Sampling technique & Delimitation)\nVariables\nTools (Description of the Tools – Author(s), Year, Target Group, No of items, Scoring, Norms, Reliability & Validity)\nStatistical techniques\nUnit- IV: Results and Discussion\nIntroduction\nTables followed with discussion\n\nUnit- V: Summary and Conclusion\nSummary (one and half pages)\nFindings\nSuggestions & Recommendations\nImplications\nConclusion\n\n\n\nReference  (APA FORMAT)\n\n\nAppendices  (Tools used, item analysis if any, special diagrams, photographs if any)\n\n\n\n\nGROUP I\n\nCourse Name: GERIATRIC: CHALLENGES AND DEVELOPMENT\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\nOBJECTIVES:\nMajor objectives of this course are:\nAcquire an insight about the aging process\nEnvisage the physical and psychological changes of the aged people\nIdentify the symptoms of mental illness in old age."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 26,
    "text": "Course Name: DISSERTATION\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\nOBJECTIVES: \nMajor objectives of this course are:\nIdentify the  research problem on the basis of relevant literature review \nAdopt appropriate research design to undertake the research study\nApply research methodology in selection of sample, finalization of tools for research\nCollect data and analyze the results\nPresent the research work in the form of dissertation\n\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Identify gap in knowledge in existing literature\nCO2(K3): Apply appropriate sampling techniques and research design\nCO3(K2): Choose appropriate psychological tools for data collection\nCO4(K6): Design an research plan and carry out a independent research\nCO5(K6): Prepare a research report\n\n\n\nSUGGESTED FORMAT FOR DISSERTATION\nLesson - Units\nUnit- I: Introduction :\nConceptual Framework / Theoretical Framework\nNeed of the study\n\nUnit- II: Review of Related Literature (Last ten years)\nIntroduction (Brief)\nStudies on variables, sample and related variables and samples\nCritical analysis of reviews collected\n\nUnit- III: Method of Investigation\nIntroduction\nStatement of the Problem\nObjectives\nHypotheses\nResearch Design (Methodology)\nSample (Sample, Sample Size, Sampling technique & Delimitation)\nVariables\nTools (Description of the Tools – Author(s), Year, Target Group, No of items, Scoring, Norms, Reliability & Validity)\nStatistical techniques\nUnit- IV: Results and Discussion\nIntroduction\nTables followed with discussion\n\nUnit- V: Summary and Conclusion\nSummary (one and half pages)\nFindings\nSuggestions & Recommendations\nImplications\nConclusion\n\n\n\nReference  (APA FORMAT)\n\n\nAppendices  (Tools used, item analysis if any, special diagrams, photographs if any)\n\n\n\n\nGROUP I\n\nCourse Name: GERIATRIC: CHALLENGES AND DEVELOPMENT\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\nOBJECTIVES:\nMajor objectives of this course are:\nAcquire an insight about the aging process\nEnvisage the physical and psychological changes of the aged people\nIdentify the symptoms of mental illness in old age. List out the welfare policies and agents for elderly care."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 27,
    "text": "List out the welfare policies and agents for elderly care. Express the issues of caregiving, case management and long term care regulations\nLEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Attain a comprehensive and scientific knowledge based on various aspects relating to  geriatric care. CO2(K3): Analyze the health issues arising during old age. CO3(K4): Illustrate the welfare needs of the aged\nCO4(K4): Demonstrate skill development in managing elderly people in the family and  community settings for the welfare of the elder persons. CO5(K6): Identify and promote support systems and networking for care of the older persons. Lesson - Units\nUnit- I: Physiological conditions of old age: Understanding the physiological conditions of old age in context to life style, socio economic conditions, gender -Old age from an old age perspective- Old age from society’s perspective – Life expectancy in India and abroad – sensory problems – vision and eye diseases – cataracts – glaucoma – hearing loses – problems in movement and balance – Parkinson disease and dental problems – alcohol abuse – sexual activity. Unit- II: Health issues in old age: Heart diseases – BP – other cardiovascular problems – arthritis, diabetics, osteoporosis, cancer, kidney or bladder diseases, incontinence, indigestion, urinary tract infections, changes in the nervous system, immune system . Unit- III: Mental illness in old age: Symptoms of mental illness in old age – stress – different forms of stressors in old age – depression – Alzheimer and dementia – confusion due to multiple medication – loneliness – panic disorder-fear of death – anxiety – reduced mental and cognitive functioning – suicidal tendency – insomnia – substance abuse – falls . Unit- IV: Care and welfare needs of old age: Physical needs – health care needs – social needs – psychological needs – financial needs – retirement – singleness – adjustment problems of the aged – violence, neglect, abuse, crime, empty nest syndrome – governmental and nongovernmental welfare measures for the aged. Unit- V: Elderly care and management: Knowledge and skills required for old age care planning- assessments – financial support- legal and medical issues – referrals, advocacy and counseling – finding the resources human and material. Recap: Problems of old age people staying at home as well as old age  homes can be reviewed."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 28,
    "text": "Recap: Problems of old age people staying at home as well as old age  homes can be reviewed. Responsible behavior of families and citizens towards old age people can be discussed. Learning Resources:\nRecommended Textbooks:\nBehr, N. K. &Monhanty R P. (2005). Aging in changing social systems – their problems. New Delhi: Discovery Publishers House. Iswar M. (2001). Aging Human Development. New Delhi: Rawat Publications. Sandrock, J.W. (1999). Lifespan development. New York: Mac-Graw Hill Publishing. References:\nJohnson. M. (2005). The Cambridge handbook of age and ageing . New York: Cambridge University Press. Mc- Innis Dittrich, K. (2009). Social work with older adults: A biopsychosocial approach to assessment and intervention. Boston: Allen and Bacon. Web sources:\nEducative videos on various welfare schemes, old age living conditions, counseling old generations and the like can be shared with the students. https://www.youtube.com/watch?v=Z_LbsK6LelE problems of elderly in India. https://www.seniority.in/blog/10-government-schemes-launched-for-the-benefit-of-senior-citizens/ aging policies and welfare schemes in India. Out of Syllabus: Self Study\nVisit to old age homes/senior citizen colony, terminally ill senior citizens can be observed a report submitted for gaining deeper understanding to the life of old people for their perspective, \nStudents can adopt an old age home and provide psychological assistance to them to better understand how to function as a psychologist. Course Name: ADDICTION COUNSELING\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\n\nOBJECTIVES: \nMajor objectives of this course are:\nGaining a basic understanding of addiction counseling and addiction theory. To familiarize with different types of drugs and their effects."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 29,
    "text": "To familiarize with different types of drugs and their effects. To enable students to use various addiction counseling assessments & diagnosis\nTo equip to students to psycho educate family members of addicted  patients\nTo formulate appropriate treatment plan with respect to biopsychosocial environment of patients \nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Distinguish various drugs and various types of addiction\nCO2(K3): Apply the knowledge relating to addiction counseling, assessment and Interview        techniques for making diagnosis\nCO3(K3): Able to Psycho educate family members to deal with addiction\nCO4(K4): Devise individualized treatment plan for addiction patients with respected to their bio-psychosocial environment\nCO5(K3): Apply various therapeutic techniques in addiction counseling. Lesson - Units\nUnit– 1: Introduction to Addiction Counseling & Therapy: Counseling relationship, establishing a genuine helping relationship, Disease model vs Moral model of Addiction, Contemporary Psychoanalytic models of addiction, Kohut’s self-psychology approach to addiction, defense mechanisms and addiction theory, advantage and disadvantages of psychoanalytic theory and contemporary analytic theories. Unit– 2: Types of Drugs and Their Effect: Drug categories, sedatives –hypnotics, stimulants, opians, narcotics, hallucinogens, and psychotropic medications. Effects of drugs on the brain, factors affecting the response to drugs, Federal Drug Administration Schedule of Drugs. Contemporary Forms of addiction: Internet, shopping, work, sex, gambling, food, gadget. Social media addiction. Addiction cycle: Emotional Trigger, Craving, Ritual, Using,Guilt. Unit– 3: Drug and Alcohol Assessments, Diagnosis and Interview Techniques: The counselor as a Facilitative Gatekeeper, Components of a Comprehensive Assessment Alcohol and Drug Assessment Instruments, Psychological Information, Medical Information. Psychological applications to addiction counseling, Assessments, techniques and Interviews, Clinical applications for counselors. Unit– 4: Families and Addiction: Bepko and Krestan Stage Theory, Family Life Cycle,Family Roles in Addicted Families, Al-Anon, Nar-Anon, Al-a-Teen, Families Anonymous, and ACOA Support Meetings, Intervention Strategies for Both Family and Addicted Member."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 30,
    "text": "Unit– 4: Families and Addiction: Bepko and Krestan Stage Theory, Family Life Cycle,Family Roles in Addicted Families, Al-Anon, Nar-Anon, Al-a-Teen, Families Anonymous, and ACOA Support Meetings, Intervention Strategies for Both Family and Addicted Member. Unit– 5: Developmental theories of Recovery, Relapse and Prevention Techniques: Developmental theory, advantages and limitations, relapse prevention, Gorski’s Relapse model, Marlatt’s Relapse model, application to addiction counseling, strengths and limitations. Biomedical model, Aversion therapy. Cognitive Therapy, Motivational Approaches to Addiction Treatment, Mindfulness based Therapies and Group Theory, Structure and Process. Learning Resources:\nRecommended Text books:\nCavaiola,A.A .,&Smith,M. (2020).A comprehensive guide to addiction theory and counseling techniques.Routledge. Brook,F.,&McHenry,B. (2015).A Contemporary Approach to Substance Use Disorders and Addiction Counseling. American Counseling Association\nWest, R. (2006). Theory of Addiction. Oxford : Blackwell. Moss, A., &Dyer,K. (2010). Psychology of Addiction. London: Palgrave Macmillan. Reference\nMiller, W.R., Zweben, A., DiClemente.,C.C&Rychtarik,R.G(1999).Motivational Enhancement Therapy Manual A Clinical Research Guide for Therapists Treating Individuals With Alcohol Abuse and Dependence.National Institute on Alcohol Abuse and Alcoholism Project MATCH Monograph Series. Web Resources\nhttps://www.counselling-directory.org.uk/addictions.html#whatisaddiction\nhttps://www.youtube.com/watch?v=ZkLtnaBpxCk\n\nOut of Syllabus- Self Study\nICD classification mental and behavioral disorders due to use of psychoactive substances\nCreating profiles of patient with mental and behavioral disorders due to use of Psychoactive substances\n\n\nCourse Name: TRAINING AND DEVELOPMENT\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\nOBJECTIVES:\nThe major objectives of this course are:\nTo introduce the fundamental concepts of training and development. To identify the need for training and to develop appropriate skills to construct objectives. To understand different approaches to training and plan training methods."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 31,
    "text": "To understand different approaches to training and plan training methods. To examine different training styles and to apply the principles to conduct training programs and ensure quality management. To build skills in evaluating the training program. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Differentiate training and development and describe its nature, need and scope. CO2(K3): Analyze and evaluate the reasons for training in the light of data collection methods, training design and learning style of participants. CO3(K4): Compare the merits and demerits of the experiential and non-experiential training techniques. CO4(K6): Formulate methods of improving productivity and quality in the workplace. CO5(K6): Recommend the techniques for evaluation of the training programme. Lesson - Units\nUnit- I: Nature and Meaning of Training and development:Training and Development – definition – difference between training and development activities– reasons for training skills – qualities of an effective trainer. Training as Performance Improvement practice. Unit- II: Training and Assessment  of needs:  Training Need Analysis – reasons , method of data collection, criteria for data collection . Learning styles of participants , factors influencing the learning process. Competence assessment and Skill gap analysis. Writing objectives: SMART objectives, ideas for writing objectives, task analysis. Unit-III: Training methods, designing and conducting: Training Programs Non-experiential training techniques – lecture method, audio visual assisted method, programmed instruction and computer assisted instruction method – suitability, advantages and limitations. Experiential Training techniques: Experiential learning approaches, simulation, in basket techniques, case study, role playing, T – groups, group discussion- Business games – suitability, advantages and limitations. Coaching and Mentoring. Conducting training programmes- training styles, gauging group dynamics.- Training the professional - presentation skills, participation materials, questing, concluding the training session. Unit-IV: Technical Training Systems: On the job and off the job technical training – training approaches to improve productivity and quality- TQM, TPM, 5-s concepts,  Six Sigma, Quality circles and Kaizen. Agile Methodology, LEAN, SCRUM, Kan-Ban, Design of Experiments. Training and career planning. UNIT V: Evaluation of Training: Purpose of evaluation, Kirkpatrick’s four levels of evaluation, guidelines for measuring the four levels, evaluation methods, ROI – process and benefits."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 32,
    "text": "UNIT V: Evaluation of Training: Purpose of evaluation, Kirkpatrick’s four levels of evaluation, guidelines for measuring the four levels, evaluation methods, ROI – process and benefits. Kaufman’s Five Levels of evaluation, The Philips ROI - process and benefits. Method of Validation, trainee validation, types of evaluation instruments - questionnaire/survey, interview, test, focus group, observation of participant, performance record. Recap: Process and skills can be recalled through role play in class room set up, for example: To prepare mini training modules and test it in stimulated corporate settings in class room set up, Prepare a report of various training techniques and challenges faced during training sessions, Identify the essential skills for an effective trainer. Learning Resources:\nRecommended Textbooks:\nCamp, R.R., Blanchard, N.P., &Huszczo, G.E. (1986).Toward a more organizationally effective training strategy and practice. New Jersey:  Prentice Hall. Goldstein. I., & Ford, K. (2001). Training in organizations. 4thed. CA: Wadsworth Thomson. Landale. A. (2006). Advanced Techniques for Training and Development. New Delhi: Infinity Books. Lynton, R. P., &Pareek, U. (2013). Training for Development. 3rded. New Delhi: India: Sage Publications. Blanchard, N.P., &Thacket, J. W. (2009). Effective training: systems, strategies and practices. New Delhi, India: Pearson Education. References:\nBiech, E. (2005). Training for dummies. Hoboken, NJ: Wiley Publishing Inc.\nSongh, P. N. (1996). Training management development. 4th ed. Mumbai: Suchandra Publications. Hardinghan, A. (1998). Training essential – Psychology for trainers. London, England: Chartered Institute of Personnel and Development. Agochiya, D. (2009). Every trainer’s handbook. 2nd edition. New Delhi: Sage Publications. Rothwell, W., Hohne, C. and King, S., 2018. Human performance improvement. England. Whitmore, J. and Lyddon, R., 2017. Coaching for Performance, 5th ed. Nicholas Brealey Publishing. Singh P N. (1996). Training Management Development."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 33,
    "text": "Training Management Development. Mumbai: Suchandra Publications. Janakiram, B. (2007). Training and Development. New Delhi: Biztantra. Web sources\nhttps://youtu.be/qBQqR_DBwlo\nhttps://youtu.be/bNp7v2e4GRs\nhttps://youtu.be/d_HHnEROyw\nhttps://youtu.be/rT4XW9ogHD0 \nhttps://youtu.be/wzicXbnmllc\n\nOut of syllabus -  Self study \nVisit a training department and submit a report on the various activities undertaken by the department. GROUP II\n\nCourse Name:  PSYCHOLOGICAL INTERVENTION FOR DEVELOPMENTAL DISORDERS \nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\n\nOBJECTIVES:\n\nOn successful completion of syllabus students will be able to: \n\n1. To introduce various Developmental Disorders\n2. To understand the causal factors of childhood disorders. 3. To gain knowledge about the different types of assessment used in psycho diagnosis of childhood disorders. 4. To explain the psychological principles in management of childhood disorders. 5. To recommend suitable intervention strategies in hypothetical case studies. LEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Describe the clinical picture of childhood disorders. CO2(K2): Explain the causal factors and prevalence of childhood disorders. CO3(K3): Compare the diagnostic criteria of different childhood disorders. CO4(K4): Identify the different types of psychological assessment of various childhood disorders. CO5(K5): Apply various behavioural management and remedial education strategies for the different developmental disorders through hypothetical case discussions. Lesson - Units\nUnit- I: Intellectual Disability - Definition, classification, prevalence,  etiology,  early identification, interpersonal deficits, behavior problems and management. Common intellectual disability syndromes - hypothyroidism, Fragile X syndrome, Down’s, William’s, PKU. Unit- II:Language and learning disabilities-  Definition, prevalence, etiology – social and\nmotivational factors. Assessment- tests of intelligence and cognitive abilities - underlying psychological and cognitive deficits. Treatment approaches-  individualized educational program, remedial teaching. Unit-  III: Attention deficit hyperactivity disorder- Diagnostic criteria – co morbid factors - academic, social &amp; conduct problems."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 34,
    "text": "Unit-  III: Attention deficit hyperactivity disorder- Diagnostic criteria – co morbid factors - academic, social &amp; conduct problems. Etiology - biological, family and social influences.Assessment -interviews, behavior rating scales. Treatment – medication, behavior\nmodification, self-regulation and cognitive behavioral intervention. Unit- IV: Anxiety and other Disorders - Generalized anxiety, separation anxiety, social phobias, school phobia, specific phobias, Obsessive Compulsive Disorder. Schizophrenia in\nchildren and adolescents. Childhood depression. Conduct disorder. habit disorders-treatment\nUnit- V:Autism spectrum disorders- Prevalence, psychological and behavioral functioning, etiology,  assessment, comprehensive educational treatment and behavioral intervention. Presentation of case formulation and recommend suitable intervention strategies in hypothetical cases. Recap: Conducting quiz, class test, assigning students to do review sessions, “Question hour”\nLearning Resources:\nRecommended Text books:\nWicks – Nelson, R., &amp; Israel, A. C. (1984). Behaviour disorders of childhood. Englewood Cliffs, New Jersey. Malavika Kapur (2011). Counselling children with psychological problems. Pearson\nDiagnostic and statistical manual of mental disorders: DSM-5TM (5th ed.). (2013)Arlington, VA, US: American Psychiatric Publishing, Inc.\n\nReference\nLearner,J.&Kline,F. (2006) Learning Disabilities and related Disorders – Characteristics and Teaching Strategies 10th ed. Houghton Mifflin\nMatson, A., & Matson (Eds.) (2009). Treating Childhood Psychopathology and Developmental Disabilities. Springer\nJacobson, M &Rojahn (2008). Handbook of Intellectual and Developmental Disabilities (Issues in Clinical Child Psychology). Springer. Thambirajah& Ramanujan (2016). Essentials of Learning Disabilities and Other Developmental Disorders. Sage Publications. Henderson,D.A.,&Thomson ,L.C. (2016) Counselling children (9 th ed.) Cengage Learning,Boston\nThomas,P.H., Fedewa,A.L. (2021) Counselling & Psychotherapy with children & Adolescents-Theory &Practice for school & Clinical settings(5 th ed.)"
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 35,
    "text": "(2021) Counselling & Psychotherapy with children & Adolescents-Theory &Practice for school & Clinical settings(5 th ed.) John Wiley &Sons,Canada\n\nWeb Resources:\nhttps://alison.com/course/understanding-child-development-and- disabilities\nhttps://www.coursera.org/learn/child-development\n\nOut of Syllabus- Self Study\nEthical and legal issues in psychological interventions with children and adolescents. Play therapy with children\n\nCourse Name:  CASE STUDY\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\n\nObjectives:\n\nMain Objectives are:\n\n1. Identify problem areas of individuals /industry to study in-depth. 2. Formulate cases / design training programme for specific purpose\n3. Apply psychological principles in imparting training /counselling\n4. Analysis the assessment results and design specific intervention programme\n5. Recommend referrals/ Career Counselling / professional development\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1 (K2) Prepare the case studies related to the different areas of counselling /Industry\nCO2 (K3) design training programme for industries with specific purpose\nCO3 (K3) Apply the Counselling process/ Intervention techniques for various clientele\nCO4 (k4) Prepare a case report based with suggestive intervention / training\nCO5 (k5) refer clients /conduct career development programmes\n\nFramework:\n\nCandidate should select at least 5 cases from different areas such as school counselling, family counselling, adolescent counselling, marital counselling, Industry specific training- Employee Counselling, Change management, Employee engagement, Employee Wellbeing, Counselling for Employee risky behaviour and geriatric counselling. The case studies reports should include\n1. Case history, e.g., Genogram of the Client / Organogram\n2. Identification of the problem\n3. Psychological Assessment- Administration, Interpretation, profiling\n4. Counselling strategies adopted for intervention /training\n5. Verbatim report of all sessions /module\n6. Summary and Outcomes\n7. learning outcome\n\n\nCourse Name:  PSYCHOTHERAPY\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\n\nOBJECTIVES:\nThe main objectives of the course are:\n1. To gain an understanding of the different types of psychological therapies\n2. To describe the application of psychological therapies."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 36,
    "text": "To describe the application of psychological therapies. 3. To explain the process of psychotherapy\n4. To understand the application of counseling and psychotherapy in groups and families. 5. To understand the procedures of certain alternative methods to psychotherapy\n\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Describe the basic concepts of different psychological therapies. CO2(K3):  Examine the process of psychological therapies. CO3(K4): Analyze skills and techniques used in specific groups/ problems. CO4(K5): Critically evaluate psychological therapies for specific groups/ problems. CO5(K5): Recommend suitable strategies to be used in hypothetical cases. Lesson - Units\nUnit- I: Psychotherapy formulation- Definition, types and purpose of formulation. Structured case formulation methods. Therapeutic process: transference, counter transference and resistance. Types of transference and counter transference. Unit- II: Group counselling and group therapy: definition – assumptions underlying group work, Historical perspective of group counselling and therapy – group dynamics and development, Therapeutic factors – Process and outcome in group counselling and psychotherapy - ethical issues in therapeutic group work. Unit- III: Family therapy: Family therapies that focus on background- Adlerian family therapy, multigenerational family therapy, Structural family therapy. Family therapies that focus on emotions, Emotionally focused couples therapy- Experiential family therapy. Skill development: genograms. Unit- IV: Supportive Psychotherapy –objectives, indications and contraindications. Supportive measures: Application of psychotherapy in certain areas : Psychotherapy for Obsessive Compulsive Disorder, personality disorders, post- traumatic stress disorder and psychoses\nUnit- V: Alternatives to counselling and psychotherapy: Eye movement desensitization therapy, Mindfulness based therapy, Neuro linguistic programming, Yoga therapy and Art Therapy. Method: Workshops to be organized by experts on these topics. Recap: Conducting quiz, class test, assigning students to do review sessions, “Question hour”\nLearning resources:\nRecommended text books:\nJacobs, Ed. E., Masson, R. L., &amp; Harvill, R.L. (2011). Group counselling –strategies and skills. (7th ed.). Pacific Grove: Brooks/Cole. Ells, Tracy.D. (2007 ). Handbook of psychotherapy –Case formulation (2 nded."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 37,
    "text": "Handbook of psychotherapy –Case formulation (2 nded. )The Guilford Press,New York\nElsie,J.S. (2016), Theories of Counselling and Psychotherapy: an integrative approach, SAGE publication, Inc, (2 nd ed.) Feltham, C., Hanley, T., &Winter, (Eds.) (2017).The SAGE Handbook of Counseling and Psychotherapy. (4th ed.) London: Sage Publications Ltd.\nSeligman, L. and Reichenberg, L. (2014). Theories of Counselling and Psychotherapy: systems, strategies and skills. 4th ed. United States of America: Pearson Education. References\nHersen, M., & Sledge, W. H. (2002). Encyclopedia of psychotherapy. Amsterdam: Academic Press. Web references\nhttps://www.ericdigests.org/1992-1/basic.htm \nhttps://www.jfhc.co.uk/play-therapy-as-a-mental-health-intervention-for-children-and-ad \nhttps://www.encyclopedia.com/education/encyclopedias-almanacs-transcripts-and-maps/crisi https://www.healthissuesindia.com/mental-health/\nOut of Syllabus- Self Study\nCase examples particularly pertaining to the Indian context. Videos of psychotherapeutic methods\nThe use of psychodrama in therapeutic change. Course Name: LEARNING DISABILITY \n\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\n\n\nOBJECTIVES:\nThe main objectives of the course are:\n\n1. To comprehend the nature, types and sources of stressors. 2. To understand the impact of stress on physical and mental health. 3. To understand the nature, types and methods of coping with stress,\n4. To appreciate and cultivate social support to mitigate stress. 5. To learn specific techniques to deal with stress with the help of practicum. LEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K1): Examine the nature and causes of stress\nCO2(K2): Identify the positive and negative effects of stress\nCO3(K3): Explain the coping style of stress. CO4(K4): Appraise the effective ways of social support. CO5(K6): Discuss the psychological techniques to manage stress."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 38,
    "text": "CO5(K6): Discuss the psychological techniques to manage stress. Lesson - Units\nUnit- I: Introduction: Definition and Meaning of Stress and Stressor; Types of stress and symptoms of stress. Factors that cause stress: The General Adaptation Syndrome, The Diathesis Stress Model, Sources of Stress\nUnit- II: Effects of Stress: Positive effects of stress: Optimal stress and positive psychological functioning. Negative effects of stress: Effect of stress on physical mental health\nUnit- III: Coping with Stress: Introduction to Coping. Personality and Coping. Coping Style: Problem Focused and Emotion Focused Coping. Spiritual coping- Yoga, Meditation. Psychosocial Resources. Resilience: Growth through Trauma. Learned optimism, Hope, gratitude as psychological moderators of stress\nUnit- IV: Social Support - Meaning Effects of Social Support on Illness. Bio psychosocial Pathways. Moderation of Stress by Social Support. Effective Types of Social Support. Enhancing Social Support. Unit- V: Interventions for Stress Management - Coping Interventions: Expressive Writing, Self-Affirmation, Relaxation Training, Exercise, Diet, Cognitive interventions, Time Management, Communication skills training: Assertiveness training\nRecap: Types and symptoms of stress, Effects of stress on physical mental health, Coping interventions. Learning resources:\nRecommended text books:\n1.Greenberg J. S (2009). Comprehensive stress management. McGraw-Hill Education. 2. Straub, O,R (2001) Health Psychology. U.S.A.: Worth Publishers. 3. Taylor, E.S. (2018). Health Psychology. (10 the.d.) India: McGraw Hill Education (India)\n4. Nanda, M. (2006). Handbook on stress management. New Delhi: Indialog Publication Pvt.Ltd. References:\nClegg. B. (2000) Instant stress management: bring calm to your life now. London: Kogan Page. DiMatteo, R.M., &amp; Marting, R.L (2002). Health Psychology, India: Pearson India Education Services Pvt. Ltd.\nNanda, M. (2006). A Handbook on Stress Management. India:lndialog Publications Pvt. Ltd\nTurkington, C. (2005) Stress management for busy people. India: McGraw-Hill."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 39,
    "text": "India: McGraw-Hill. Web sources:\nhttp://opentextbc.ca/introductiontopsychology/chapater/15-2-stress-and-coping/- Stress and coping \nhttp://courses.lumenlearning.com/boundless-psychology/chapater/coping-with-and- managing-stress/ - Coping with and managing stress. http://www.garrettcollege.edu/images/faculty/kasecamp/PSY101/psy7.pdf- Notes - Health, Stress &amp; Coping \nhttp://college.cengage.com/psychology/bernstein/essentials/4e/assets/instructors/outlines/ch10_outline.pdf - Chapter Health, Stress and coping. Out of Syllabus (Self Study):\nHealth-Endangering Behaviors\nPromoting Healthy Behavior\nCognitive coping strategies change the thinking process about stressors. James Prochaska - five stages of successful change\n\n\n\t\tGROUP-III\nCourse Code:  RELATIONSHIP COUNSELING FOR CHILDREN AND YOUNG PEOPLE\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\nOBJECTIVES:\n\nOn successful completion of syllabus students will be able to: \n\nFamiliarize concepts, models and theories related to Relationship counseling\nAcquire advanced theoretical understanding of Counseling with Children and Young People, integrating opportunities to develop professional and practical counseling skills. Apply Relationship counseling skills in real time scenarios\nTo learn competences based on professional body standards to work with children and young people\nIdentifying the ways in which children and young people manage and process their emotions, including the ability to recognise situations where they are finding it difficult to access these\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K3): Demonstrate counseling techniques to help child explore relationships\nCO2(K3): Employ strategies to address child and young people relationship with significant others\nCO3(K3): Apply  relationship counseling techniques to attend to a young person’s relationships."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 40,
    "text": "Apply Relationship counseling skills in real time scenarios\nTo learn competences based on professional body standards to work with children and young people\nIdentifying the ways in which children and young people manage and process their emotions, including the ability to recognise situations where they are finding it difficult to access these\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K3): Demonstrate counseling techniques to help child explore relationships\nCO2(K3): Employ strategies to address child and young people relationship with significant others\nCO3(K3): Apply  relationship counseling techniques to attend to a young person’s relationships. CO4(K3): Apply family therapy practice focussing child and adolescence\nCO5(K3): Implement evidence based  practice that is ethically oriented and ensures safety of the clients\nLesson - Units\nUnit- I: Helping and Exploring Child’s Relationship: Helping the Child to Talk about Their Relationships- Contracting with Parents, The Purpose of Individual Counseling, Attributes of the Child’s Counsellor, Combining Media and Activity with Counseling Skills, Joining with the Child."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 41,
    "text": "CO4(K3): Apply family therapy practice focussing child and adolescence\nCO5(K3): Implement evidence based  practice that is ethically oriented and ensures safety of the clients\nLesson - Units\nUnit- I: Helping and Exploring Child’s Relationship: Helping the Child to Talk about Their Relationships- Contracting with Parents, The Purpose of Individual Counseling, Attributes of the Child’s Counsellor, Combining Media and Activity with Counseling Skills, Joining with the Child. Combining Media and Activity with Counselling Skills, Exploring the Child’s Relationships with Parents and Siblings- Working with Children of Age 7 Upwards Using Miniature Animals, Working with Children of Age 5–7 Using Symbols in the Sand Tray, Working with Children of Below Age 5 Using Imaginative Pretend Play, Integration of Individual Counselling Work for the Child with Family Counselling,\nUnit- II: Addressing Child Relationship: Addressing the Child’s Relationships with Parents and Siblings- Whole Family Counselling, Counselling for Individual Children, Group Counselling for the Children Concerned, Using Clay to Address Relationship Issues between Siblings, Counselling for the Parent/s and Child/Children , Family Counselling to Integrate and Complete the Work,  Addressing the Child’s Relationships with Peers, Teachers and Other Adults- The Role of Parents, The Development of Social Skills, Relationship Counselling for the Child,\nUnit- III: Young person's relationship with Family: Helping Young People to Talk About their Relationships- Being Authentic and Open, Drawing on Existentialist Philosophy and Constructivist Thinking, Being Proactive in Introducing Creative, Experiential, Cognitive, and Psycho-educational Strategies, Responding to the Young Person’s Developmental Needs, Working Within the Young Person’s Constructs, Matching an Adolescent Style of Communication, Relevant Counselling Skills, Transitional, Choice and Guru Questions, Normalizing, Attending to the Young Person’s Relationships within the Family- Ways to Attend to the Young Person’s Relationships in the Family, Family Counselling, Individual Counselling, Young Person–Sibling Subgroup Counselling, Young Person–Parent Subgroup Counselling, Integration into Whole Family Counselling."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 42,
    "text": "Combining Media and Activity with Counselling Skills, Exploring the Child’s Relationships with Parents and Siblings- Working with Children of Age 7 Upwards Using Miniature Animals, Working with Children of Age 5–7 Using Symbols in the Sand Tray, Working with Children of Below Age 5 Using Imaginative Pretend Play, Integration of Individual Counselling Work for the Child with Family Counselling,\nUnit- II: Addressing Child Relationship: Addressing the Child’s Relationships with Parents and Siblings- Whole Family Counselling, Counselling for Individual Children, Group Counselling for the Children Concerned, Using Clay to Address Relationship Issues between Siblings, Counselling for the Parent/s and Child/Children , Family Counselling to Integrate and Complete the Work,  Addressing the Child’s Relationships with Peers, Teachers and Other Adults- The Role of Parents, The Development of Social Skills, Relationship Counselling for the Child,\nUnit- III: Young person's relationship with Family: Helping Young People to Talk About their Relationships- Being Authentic and Open, Drawing on Existentialist Philosophy and Constructivist Thinking, Being Proactive in Introducing Creative, Experiential, Cognitive, and Psycho-educational Strategies, Responding to the Young Person’s Developmental Needs, Working Within the Young Person’s Constructs, Matching an Adolescent Style of Communication, Relevant Counselling Skills, Transitional, Choice and Guru Questions, Normalizing, Attending to the Young Person’s Relationships within the Family- Ways to Attend to the Young Person’s Relationships in the Family, Family Counselling, Individual Counselling, Young Person–Sibling Subgroup Counselling, Young Person–Parent Subgroup Counselling, Integration into Whole Family Counselling. Unit –IV: Young Persons relationship with Significant Others: Focusing on the Young Person’s Relationships with Peers- Building and Maintaining Relationships, The Influence of Peer Pressure, Dealing with Sexuality Issues, Individual Counselling, Group Counselling, Addressing a Young Person’s Relationships with Teachers, Employers and Other Adults- Expectations of Teachers and Employers, Counselling Strategies. Unit- V: Family Therapy practice with Child and Adolescent focused problems: Family Therapy for Child physical abuse-Contracting for Assessment, Assessment, Contracting for treatment, treatment. Family therapy for Child sex abuse - Contracting for Assessment, Assessment, Contracting for treatment: Family treatment interventions."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 43,
    "text": "Family therapy for Child sex abuse - Contracting for Assessment, Assessment, Contracting for treatment: Family treatment interventions. Family therapy for Conduct problems - Contracting for Assessment, Assessment, Contracting for treatment, treatment. Family therapy for Drug abuse in Adolescence-  Contracting for Assessment, Assessment, Contracting for treatment, treatment\n\nRECAP: Addressing child and young people's relationship with peers and parents can be discussed with the help of role play, Different assessment methods can be reviewed\n\nLearning Resources:\nRecommended Text books:\nAlan Carr (2006). Family therapy - Concepts, Process and Practice. 2nd edition, John wiley& sons ltd, New york\nKathryn Geldard and David Geldard (2009). Relationship Counselling for Children, Young People and Families, SAGE Publications India Pvt Ltd, New Delhi\n\n\nReferences: \nAndreozzi, L.L. (1996) Child-centered FamilyTherapy. NewYork:Wiley\nBailey, C.E. and Sori, C.E.F. (2005) Involving parents in children therapy. In C.E. Bailey (ed. ), Children in Therapy: Using the Family as a Resource. New York: W.W. Norton. Bearsley-Smith, C. (2007) Adapting family therapy for step-families\nGeldard, K. (2006) Adolescent peer counselling. Unpublished doctoral dissertation. Queensland University of Technology, Brisbane,Queensland,Australia\nGeldard, K. and Geldard, D. (2008b) Personal Counseling Skills: An Integrative Approach. Springfield, IL:Thomas\nDonald, C., & Atkinson, R. D. (2002).Counselling across life span, Sage Publications\nGutstein, S., &Sheely, R. K. (2002). Relationship development intervention with children, adolescents and adults: Social and emotional development activities for Asperger syndrome, autism, PDD and NLD. Jessica Kingsley Publishers. Nelson-Jones (2010). The theory and practice of counselling and Therapy (5thed). Sage. Rosemary A Thompson (2016).Counselling Techniques-Improving relationships with others, ourselves, our families, and our environment, 3rded.Routledge. Sederholm, G. H. (2002). Counselling young people in school."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 44,
    "text": "Counselling young people in school. Jessica Kingsley Publishers. Web Resources: \nExtended demonstration of school-based humanistic counselling: Sophia\nChild Counseling Skills\nOut of Syllabus- Self Study\nTo prepare a complete case history of the client\nTo conduct a Mental status examination for a client and submit a summarized report\n\n\n\n\nCourse Name: DYNAMICS IN PARENTING\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\nOBJECTIVES:\n\nThe main objectives of the course are:\nTo understand the skills involved in parenting. To familiarize the dynamic components of parents – child relationship\nTo explain the role parenting emotional regulation\nTo analyze the effects of reciprocal relationship between parents- Children and special\nchildren\nTo evaluate the Nature of Couple Relationships on relationship distress\nLEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K2): Discuss the facets of parenting. CO2(K2): Explain the dynamic processes in parent-child relationship\nCO3(K6): Develop an understanding effect of family structures and couple relationships on parenting. CO4(K5): Analysis various reciprocal relationship effect on children and special children\nCO5(K3): Apply various models of parenting to understand nature of couple relationship on children\nLesson - Units\nUnit- I: Introduction: Parenting Styles and Practices, Functions of Parenthood, Parenting Tasks and Phases of Development, Parenting in Different Family Contexts. Unit- II: Parent–Child Relationships and Attachment - A Model for Parent–Child Relationships, Attachment, Individual Differences in the Quality of Child Attachment, Child Attachment and Developmental Consequences, The Parent’s Perspective: Representations of the Child and Relationship, Parental Interactive Behavior and Disorganized Child Attachment\nUnit- III: Effects of Parenting on Emotion and Self-Regulation – Self Regulation and Emotional Regulation and its importance, Emergence of Self-Regulation and Emotion Regulation During Childhood, Effects of Parenting on Children’s Self-regulation, Effects of Parenting on Children’s Emotion Regulation. Unit- IV: Child Characteristics and Their Reciprocal Effects on Parenting - Changing Conceptualizations of Child Development and Parenting, Child Individuality, Individual Differences in Temperament and Personality, Biological Underpinnings of Temperament, Temperament and Parenting, Gender Differences."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 45,
    "text": "Unit- IV: Child Characteristics and Their Reciprocal Effects on Parenting - Changing Conceptualizations of Child Development and Parenting, Child Individuality, Individual Differences in Temperament and Personality, Biological Underpinnings of Temperament, Temperament and Parenting, Gender Differences. Children with developmental disorders – Process of diagnosis, features of some developmental disorders, Issues related to parents, Parenting practices and child developmental\nUnit- V:Family Structure and the Nature of Couple Relationships: Relationship Distress, Separation, Divorce, and Re-partnering - Process Model of the Determinants of Parenting, Family Systems Theory and Indirect Effect Models, Relationship Distress in Parental Couples, Separation and Divorce Among Parents, Re-partnering and Stepfamilies. Recap: Dynamics of parenting in various setup, parenting models, couple relationship and its\nreflection on children’s distress, parenting and emotional regulation\n\nLearning Resources:\nRecommended Text books:\nR. Sanders, M., &Morawska, A. (2019). HANDBOOK OF PARENTING AND CHILD DEVELOPMENT ACROSS THE LIFESPAN (1st ed.). Springer International Publishing AG. Hurlock, E. (1981). Developmental psychology. New Delhi: Tata McGraw-Hill. References:\nJanet Levine (2003) “know your parenting Personality” John wiley&amp; sons,inc. Lindsay C. Gibson (2015) “ Adult Children of Emotionally Immature Parents”, New harbinger publications. Marc h. Bornste (2008) “Promoting Positive Parenting- An attachment – Lawrence Erlbaum Associates."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 46,
    "text": "Marc h. Bornste (2008) “Promoting Positive Parenting- An attachment – Lawrence Erlbaum Associates. Web Sources:\nhttps://www.youtube.com/watch?v=hY29SPXCxLA \nhttps://www.youtube.com/watch?v=fyO8pvpnTdE \nhttps://www.youtube.com/watch?v=WjOowWxOXCg \nhttps://www.youtube.com/watch?v=A71OktxTPac \nhttps://www.youtube.com/watch?v=6fL09e8Tm9c\n\nOut of Syllabus- Self Study\nCase studies on various type of parenting\nPreparing short training modules on parenting\nPositive parenting model\nCounselling intervention for handling special children\n\n\nCourse Name: CORPORATE COUNSELLING\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\n\nOBJECTIVES:\nThe main objectives of the course are:\nUpdated knowledge on Corporate Counseling in context\nUnderstand various workplace models and distinguish the importance of each model\nExplain the skills and process related to professional practices in work setup\nDiscuss various factors contribute towards work stress and its effect on organization\nMake students apply various psychological principles in employee well-being. LEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K1): Outline differentiate counseling in workplace set up and relate to different models\nCO2(K2): Discuss occupational factors to identify the need for counseling\nCO3(K3): Apply skills and process of counseling in corporate setup\nCO4(K4): Describe different methods of employee group counseling and identify skills for dealing with problem behaviors in workplace\nCO5(K3): Apply various counseling interventions for employee specific issues in workplace\n\nLesson - Units\nUnit- I: Understanding workplace counseling- Concept of workplace counseling- history of a workplace counseling- faces of workplace counseling- professional relationships in counseling in the workplace – Ethics and ethical issues in workplace counseling. Unit- II:Overview of Models of Workplace counseling: Counseling oriented models, brief therapy model, problem focused models, work oriented models, manager based models- Externally based models, Internally based models, welfare based models, organizational change based models\nUnit- III:  Setting up counseling in the workplace- preparation- assessment- contracting -Engaging in counseling- termination- evaluation- Integrative model of individual employee counseling - Training for Workplace Counselors."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 47,
    "text": "Unit- II:Overview of Models of Workplace counseling: Counseling oriented models, brief therapy model, problem focused models, work oriented models, manager based models- Externally based models, Internally based models, welfare based models, organizational change based models\nUnit- III:  Setting up counseling in the workplace- preparation- assessment- contracting -Engaging in counseling- termination- evaluation- Integrative model of individual employee counseling - Training for Workplace Counselors. Unit- IV: Work Stress- Stressful job factors, Occupational Stress; dealing with difficult people, sexual harassment, and unethical behaviour in the work place, Travel stress, Time stress, Work stress and families. Group Counseling: Conflict resolution, interpersonal, familial, team building, negotiation and arbitration skills. Unit- V: Impact of organization on workplace counseling- Employee Problem specific Counseling – Problems of absenteeism turnover, Burnout, Depression, Substance abuse. Recap: Importance of counseling in corporate setup, professional relationship between counselor and employee in workplace, various models of workplace counseling and its significance, group counseling techniques and process used in corporate set up and application of counseling in workplace related issues. Learning resources:\nRecommended text books:\nMichael, C. (1996). Work place counseling – a Systematic approach to employee care, Sage Publications. Jacobs, Ed. E., Masson, R. L., &Harvill, R.L. (2002). Group counseling – strategies and skills. (7thed.). Pacific Grove: Brooks/Cole. Adrian Coles, A (2003). Counseling in the Workplace. Open University Press, McGraw-Hill Education (UK)\n\nReferences:\nVardi,&Weitz.E (2004). Misbehavior in organization – theory research and management. New Jersey: Lawrence Erlbaum associates. Cartwright, S. & Cooper, C. (1997). Managing Workplace Stress, Sage  Publications. Patterson, L. E.&Welfel, E. R. The counseling process,5  TH edition. Brooks/Cole ,Thomson Learning. Nelson - Jones, R. (2002). Essential counseling and therapy skills, Sage Publications\nRosemary A Thompson (2016). Counseling Techniques-Improving relationships with others, ourselves, our families, and our environment, 3rd ed. Routledge. Web Sources:\nCounselling a staff member to improve performance\nHow To Improve Communication Skills?"
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 48,
    "text": "Web Sources:\nCounselling a staff member to improve performance\nHow To Improve Communication Skills? 12 Effective Tips To Improve Communication Skills\nCorporate Counselling\nStress in the Workplace\nhttps://trijog.com/corporate-wellness/?utm_term=employee%20assistance%20program&hsa_acc=2784775574&hsa_cam=11137618726&hsa_grp=117644457268&hsa_ad=466177713049&hsa_src=s&hsa_tgt=kwd-12843221&hsa_kw=employee%20assistance%20program&hsa_mt=b&hsa_net=adwords&hsa_ver=3\n\nOut of Syllabus (Self Study):\nTrends in corporate counseling\nRecent issues and challenges for corporate employees\nDigital detoxification\nStress management group techniques – yoga, mindfulness meditation, Taichi , Zumba etc. Solution focused models in corporate set\n\nCourse Name: ENHANCEMENT OF EMOTIONAL INTELLIGENCE\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 3\nOBJECTIVES:\nThe main objectives of this course are to enable students:\n1. To understand emotional intelligence and the skills of it. 2. To identify the emotions of self. 3. To know various methods of self-management. 4. To identify the emotions of other people. 5. To deal with Difficult Friends and Relatives. LEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K1): Identify the impact and skills necessary for Emotional Intelligence\nCO2(K2): Describe the strategies essential for being aware of self. CO3(K3): Examine the techniques for self Management\nCO4(K5): Appraise the social awareness strategies for becoming emotionally intelligent. CO5(K6): Develop techniques for efficient relationship management. Lesson - Units\nUnit- I: Introduction to Emotional Intelligence-  Meaning and definition - Impact of Emotional Intelligence — Four Skills of Emotional Intelligence: Self- awareness, Self- management, Social-Awareness and Relationship Management - Action Plan to increase Emotional Intelligence. Unit- II: Strategies for Self-awareness - Definition of feelings -Identification of Emotions of Self — Recognition of Emotions: Interpreting behaviours, examining self-destructive behaviours, Understanding body language and Identification of Emotions through other people- Changing Negative Emotions: Recognizing negative emotions."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 49,
    "text": "Unit- II: Strategies for Self-awareness - Definition of feelings -Identification of Emotions of Self — Recognition of Emotions: Interpreting behaviours, examining self-destructive behaviours, Understanding body language and Identification of Emotions through other people- Changing Negative Emotions: Recognizing negative emotions. Unit- III: Strategies for Self-Management-Acceptance of Emotions: Cognitive Restructuring, Methods of Distraction, Relaxation, Meditation and Similar Activities and Application of Mindfulness- Recognizing the Importance of Practice. Unit- IV: Strategies for Social Awareness - Difference between Empathy and Sympathy -Identification of Emotions of Other People, Understanding Empathy, Listening, Facial Cues and Decoding body language- Practice Empathy: Determine Emotions of others- Usefulness of Empathy, Dealing with intimate Relationships, Dealing with Friends & Relatives and dealing with strangers. Unit- V: Strategies for Relationship Management: Controlling the Reactions to Others Emotions: Being aware of the gut reaction and working through alternative responses - Influencing Other People's Emotions - Encountering Difficult People: Determining the best outcome with a difficult person, Techniques for dealing with difficult people - Dealing with Difficult Friends and Relatives. Recap: Four Skills of Emotional Intelligence, Understanding body language and Identification of Emotions through other people, Difference between Empathy and Sympathy\n\t\nLearning Resources:\nRecommended Text books:\nStein. S. J. (2009). Emotional Intelligence for Dummies. Canada: John Wiley & Sons. Bradberry, T..Greaves. J., Lencioni, P.M. (2005) The Emotional Intelligence Quick Book: Everyhing You Need to Know to Put Your EQ to Work. ISBN 978-0743273268: Touchstone\nStein. S. J.. Book, H. E. (2011). The EQ Edge: Emotional Intelligence and Your Success. (3\" ed.). ISBN 978-0470681619: Jossey-Bass. References:\nl. Goleman. B. (20 19). Emotional Intelligence: For a Better Life, success at work, and happier relationships. Improve Your Social Skills, Emotional Agility and Discover Why it Can Matter More Than IQ. (EQ 2.0). ISBN 978-1077972131: Independently Published\n2 Goleman, D. (2011)."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 50,
    "text": "ISBN 978-1077972131: Independently Published\n2 Goleman, D. (2011). The Brain and Emotional Intelligence: New Insights. (2nd ed.). : More Than Sound LLC\n3. Segal. J. (2008). The Language of Emotional Intelligence: The Five Essential Tools for Building Powerful and Effective Relationships (NTC SELF-HELP). ed.). ISBN 978-007154455: McGraw- Hill Education;\n\nWeb Sources:\nhttps://www.verywelImind.com/what-is—emotional-intelligence-2795423\nhttps://brm.institute/strategies-increase-self-awareness/\nhttps://aliabdaal.com/self—management-skills/\nhttps://www.trainerbubble.com/downloads/emotional-intelligence-e-learning/\nhttps://elearningindustry.com/ways-facilitate-emotional-intelligence\nhttps://blog.neolms.com/how-online-courses-can-nurture-emotional-intelligence/\nhttps://www.coursera.org/learn/emotional-and-social-intelligence/\nhttps://positivepsychology.com/emotional-intelligence-training/\n\nOut of Syllabus- Self Study\n\nMeasuring emotional intelligence. Finding happiness and happy people\nIdentify the difference between EQ and IQ\nInvestigating science behind emotional intelligence. Construct a simple  emotional intelligence assessment\n\n\nGROUP-IV\nCourse Name: COMPUTER ASSISTED RESEARCH SKILLS\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\nOBJECTIVES: \nMajor objectives of this course are:\n1. To have hands-on training on state-of-the-art technology developments in research. 2. To gain knowledge in various statistical test using SPSS\n3. To identify appropriate statistical analysis for the research\n4. To gain familiarity with various concepts in SPSS\n5. To Interpret data output in SPSS\n\nCOURSE OUTCOME:\nOn successful completion of course the students will be able to\nCO1(K2): Comprehend the basics in research methodology and fundamentals of using SPSS\nCO2(K2): Acquire knowledge on overview of statistical tests in SPSS\nCO3(K3): Create graphical representations and charts. CO4(K4): Statistically Analyze given research data and represent in required format\nCO5(K5): Apply knowledge acquired in preparing a research  report."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 51,
    "text": "CO4(K4): Statistically Analyze given research data and represent in required format\nCO5(K5): Apply knowledge acquired in preparing a research  report. Lesson - Units\nUnit- I: Basics in Research methodology -Variable, data format, coding, measurement, research questions, hypothesis, statistics, interpretation, discussion. Computers - operating system, on- line off-line usage, scope and utilities in every stage of research. On-line database Psy-INFO Direct, Reference manager softwares - Mendeley, Papership, EndNote, Zotero. Unit- II: Fundamentals of Using SPSS - Introduction to what SPSS can do, Descriptive information and statistics, An overview of statistical tests in SPSS , Exploring data with graphics, Reading Raw Data into SPSS, Input of raw data into SPSS, Input of data directly into the SPSS Data Editor. Unit- III: Basic Data Management in SPSS - Creating and recoding variables, Using SPSS functions for making/recoding variables, Subsetting variables and observations, Analysis of a subset of a data.Labeling and documenting data, SORT and SPLIT BY, Missing data in SPSS. Unit- IV: Data Analysis: Creating and editing graphs and charts, Exploratory data analysis: scale data, Probability and inferential statistics, Comparing categorical variables, Mean differences between groups: “t” test, ANOVA, ANCOVA, MANOVA, MANCOVA, correlation, regression, multiple and hierarchical regression,, factor analysis – exploratory and confirmatory - structural model. Unit- V: Interpretation and presentation: Prepare the report on statistical data analysis in the appropriate formats, Use the related software (Word, Excel) as an additional tool for preparing a good report. Recap: Demonstration of online database and reference managing software can be done . Learning Resources:\nRecommended Text books:\n1. McCormick, K., & Salcedo, J. (2020). SPSS statistics for dummies. John Wiley & Sons. 2. Aldrich, J. O. (2018). Using IBM SPSS statistics: An interactive hands-on approach:   Sage Publications. References:   \nBrace ,K., Kemp, R. &Snelgar R ( 2009) Spss for Psychologist – a guide to data analysis using SPSS. Palgrave macmillan\nMayers, A."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 52,
    "text": "Palgrave macmillan\nMayers, A. (2013) Introduction to statistics and SPSS in Psychology  . Pearson Education\n\nWeb Source:\nhttps://www.youtube.com/watch?v=rBj3gyNaTW4\nhttps://www.youtube.com/watch?v=_zFBUfZEBWQ\nhttps://www.youtube.com/watch?v=GQP47ijt4LI\nOut of Syllabus- Self Study\nWith the help of hypothetical data students can do various  statistical test  and  report in   appropriate formats\nStudents can explore AMOS  and R Software\n\n\nCourse Name: SCIENTIFIC REPORT WRITING\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\nOBJECTIVES:\nThe major objectives of this course are:\nTo describe the process of writing skills. To apply Microsoft office features in preparing the reports. To choose APA style in writing and publication of research papers. To articulate how to write a research proposal. To combine reports on various forms of qualitative and quantitative research methods. LEARNING OUTCOMES: \nOn successful completion the students will be able to :\nCO1(K2): Explain the process of writing skills. CO2(K3): Practice Microsoft office. CO3(K4): Apply APA style in writing and publication of research papers. CO4(K4): Articulate how to write a research proposal. CO5(K6): Critically compile  reports on various forms of qualitative and quantitative research methods. Lesson - Units\nUnit- I: Written Communication – basics, parts of written communication, punctuation, common grammatical errors; spelling, commonly confused words, gender; Style – flow of writing, making writing lively, use of style in writing sentences and paragraphs. Unit- II: Manuscript writing – critical appraisal using journal articles, review of literature, writing and publication of research papers\nUnit- III: The process of writing-  Audience analysis, planning, collecting relevant materials, organizing ideas; specific writing situations and writing. Unit- IV: Plagiarism - Software for grammar and plagiarism check. Unit- V: APA style –Basics of APA, in-text citations, formatting and writing Reference. Recap: Required portions of the units may be presented by the course faculty giving life examples from published research to explain the different publishing styles . Learning Resources:\n\nRecommended Textbooks:\nWest.C."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 53,
    "text": "Learning Resources:\n\nRecommended Textbooks:\nWest.C. (2008).PerfectWrittenEnglish–All you need to get it right first time, New Delhi: Random Books House. Monippally. M. M. & Pawar. B. S. (2010). Academic Writing – A guide for Management students and researchers. Response books, New Delhi: Sage Publications. American Psychological Association(2010) – Publication Manual of the American Psychological Association, (7thed.). Washington DC.Author. References:\n100 tips to avoid mistakes in academic writing and presenting . (2020). Wallwork, A & Southern, A.  USA: Springer publications. Write an impactful research paper (2021). Zaumanis, M.\nKail, R. V. (2018). Scientific Writing for Psychology. Lessons in Clarity and Style. 2nd edition. USA: Sage Publishing Inc.\nMcInerney, D. M.  (2021). Publishing your psychology research. A guide to writing for journals in psychology and related fields. USA: Routledge Publishers. Web sources\nHow to format your paper in APA style in 2022\nMy Step by Step Guide to Writing a Research Paper\nHow to add citations and references in research paper, thesis, how to use different citations style\nReferences in APA Style | Writing Research Papers | UC San Diego Psychology\nHow to remove Plagiarism from Article\n\nOut of Syllabus: Self Study\nStudents can present a review of a research paper highlighting methodological errors, non APA style compliance and suggest means of improvising the quality of the paper for publication in high impact journals. Identify list of approved journals and high impact journals in their field and related disciplines for publications. Course Name: INTERPERSONAL AND COMMUNICATION SKILLS\nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\n\nLEARNING OBJECTIVES:\n\nOn successful completion of syllabus students will be able to: \n\n1. To comprehend the nature, types and sources of stressors. 2. To understand the impact of stress on physical and mental health. 3. To understand the nature, types and methods of coping with stress,\n4. To appreciate and cultivate social support to mitigate stress. 5. To learn specific techniques to deal with stress with the help of practicum."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 54,
    "text": "To learn specific techniques to deal with stress with the help of practicum. LEARNING OUTCOMES: -\nOn successful completion the students will be able to :\nCO1(K1): Examine the nature and causes of stress\nCO2(K2): Identify the positive and negative effects of stress\nCO3(K3): Explain the coping style of stress. CO4(K4): Appraise the effective ways of social support. CO5(K6): Discuss the psychological techniques to manage stress. Lesson - Units\nUnit-I: Introduction: Definition and Meaning of Stress and Stressor; Types of stress and symptoms of stress. Factors that cause stress: The General Adaptation Syndrome, The Diathesis Stress Model Sources of Stress\n\nUnit- II-Effects of Stress - Positive effects of stress: Optimal stress and positive psychological functioning. Negative effects of stress: Effect of stress on physical mental health\n\nUnit-III- Coping with Stress - Introduction to Coping. Personality and Coping. Coping Style: Problem Focused and Emotion Focused Coping. Spiritual coping- Yoga, Meditation. Psychosocial Resources. Resilience: Growth through Trauma. Learned optimism, Hope, gratitude as psychological moderators of stress\n\nUnit- IV- Social Support - Meaning Effects of Social Support on Illness. Bio psychosocial Pathways. Moderation of Stress by Social Support. Effective Types of Social Support. Enhancing Social Support. Unit- V- Interventions for Stress Management - Coping Interventions: Expressive Writing, Self- Affirmation, Relaxation Training, Exercise, Diet, Cognitive interventions, Time Management, Communication skills training: Assertiveness training. Recap\nTypes and symptoms of stress\nEffects of stress on physical mental health. Coping interventions. Recommended Texts\n1.Greenberg J. S (2009). Comprehensive stress management. McGraw-Hill Education. 2. Straub, O,R (2001) Health Psychology. U.S.A.: Worth Publishers. 3. Taylor, E.S. (2018). Health Psychology. (10 the.d.) India: McGraw Hill Education (India)\n4. Nanda, M. (2006). Handbook on stress management. New Delhi: Indialog Publication\nPvt.Ltd. References:\n1. Clegg. B. (2000) Instant stress management: bring calm to your life now. London: Kogan\nPage. 2."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 55,
    "text": "2. DiMatteo, R.M., &amp; Marting, R.L (2002). Health Psychology, India: Pearson India\nEducation Services Pvt. Ltd.\n3. Nanda, M. (2006). A Handbook on Stress Management. India:lndialog Publications Pvt. Ltd\n4. Turkington, C. (2005) Stress management for busy people. India: McGraw-Hill. Web Resource:\n\nhttp://opentextbc.ca/introductiontopsychology/chapater/15-2-stress-and-coping/- Stress and Coping\nhttp://courses.lumenlearning.com/boundless-psychology/chapater/coping-with-and- managing-stress/ - Coping with and managing stress. http://www.garrettcollege.edu/images/faculty/kasecamp/PSY101/psy7.pdf- Notes - Health, Stress &amp; Coping\nhttp://college.cengage.com/psychology/bernstein/essentials/4e/assets/instructors/outlines/ch10_outline.pdf - Chapter Health, Stress and coping. Out of Syllabus- Self Study\nHealth-Endangering Behaviors\nPromoting Healthy Behavior\nCognitive coping strategies change the thinking process about stressors. James Prochaska - five stages of successful change\n\nCourse Name:  STRESS MANAGEMENT \nCourse Code:\nYear and Semester:      rdyr ,th Semester\nCredits : 2\n\nOBJECTIVES:\n\nThe main objectives of this course are to enable students:\n\n1. To comprehend the nature, types and sources of stressors. 2. To understand the impact of stress on physical and mental health. 3. To understand the nature, types and methods of coping with stress,\n4. To appreciate and cultivate social support to mitigate stress. 5. To learn specific techniques to deal with stress with the help of practicum. COURSE OUTCOMES:\n\nOn successful completion of the course, the learners will be able to:\n\nCO1(K1): Examine the nature and causes of stress\nCO2(K2): Identify the positive and negative effects of stress\nCO3(K3): Explain the coping style of stress. CO4(K4): Appraise the effective ways of social support. CO5(K6): Discuss the psychological techniques to manage stress. Lesson - Units\nUnit- I - Introduction - Definition and Meaning of Stress and Stressor; Types of stress and symptoms of stress."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 56,
    "text": "Lesson - Units\nUnit- I - Introduction - Definition and Meaning of Stress and Stressor; Types of stress and symptoms of stress. Factors that cause stress: The General Adaptation Syndrome, The Diathesis Stress Model Sources of Stress\n\nUnit- II -Effects of Stress - Positive effects of stress: Optimal stress and positive psychological functioning. Negative effects of stress: Effect of stress on physical mental health\n\nUnit-III- Coping with Stress - Introduction to Coping. Personality and Coping. Coping Style: Problem Focused and Emotion Focused Coping. Spiritual coping- Yoga, Meditation. Psychosocial Resources.Resilience: Growth through Trauma. Learned optimism, Hope, gratitude as psychological moderators of stress\n\nUnit- IV- Social Support - Meaning Effects of Social Support on Illness. Bio psychosocial Pathways. Moderation of Stress by Social Support. Effective Types of Social Support. Enhancing Social Support. Unit-V-  Interventions for Stress Management - Coping Interventions: Expressive Writing, Self- Affirmation, Relaxation Training, Exercise, Diet, Cognitive interventions, Time Management,Communication skills training: Assertiveness training\n\nRecap\nTypes and symptoms of stress\nEffects of stress on physical mental health. Coping interventions. Learning resources:\nRecommended Texts\n1.Greenberg J. S (2009). Comprehensive stress management. McGraw-Hill Education. 2. Straub, O,R (2001) Health Psychology. U.S.A.: Worth Publishers. 3. Taylor, E.S. (2018). Health Psychology. (10 the.d.) India: McGraw Hill Education (India)\n4. Nanda, M. (2006). Handbook on stress management. New Delhi: Indialog Publication Pvt.Ltd. References:\n1. Clegg. B. (2000) Instant stress management: bring calm to your life now. London: Kogan Page. 2. DiMatteo, R.M., &amp; Marting, R.L (2002). Health Psychology, India: Pearson India Education Services Pvt. Ltd.\n3. Nanda, M. (2006). A Handbook on Stress Management. India:lndialog Publications Pvt. Ltd\n4. Turkington, C. (2005) Stress management for busy people. India: McGraw-Hill."
  },
  {
    "source_file": "M.Sc. Applied Psychology.docx.txt",
    "page": -1,
    "chunk_number": 57,
    "text": "India: McGraw-Hill. Web sources:\nhttp://opentextbc.ca/introductiontopsychology/chapater/15-2-stress-and-coping/- Stress and coping\nhttp://courses.lumenlearning.com/boundless-psychology/chapater/coping-with-and-\nmanaging-stress/ - Coping with and managing stress. http://www.garrettcollege.edu/images/faculty/kasecamp/PSY101/psy7.pdf- Notes - Health,Stress&amp; Coping\nhttp://college.cengage.com/psychology/bernstein/essentials/4e/assets/instructors/ outlines/ch10_outline.pdf - Chapter Health, Stress and coping. \\\nOut of Syllabus (Self Study):\nHealth-Endangering Behaviors\nPromoting Healthy Behavior\nCognitive coping strategies change the thinking process about stressors. James Prochaska - five stages of successful change\n\n\n"
  }
]